{
  "version": "1.0",
  "truncation": null,
  "padding": null,
  "added_tokens": [
    {
      "id": 0,
      "content": "<pad>",
      "single_word": false,
      "lstrip": false,
      "rstrip": false,
      "normalized": false,
      "special": true
    },
    {
      "id": 1,
      "content": "<s>",
      "single_word": false,
      "lstrip": false,
      "rstrip": false,
      "normalized": false,
      "special": true
    },
    {
      "id": 2,
      "content": "</s>",
      "single_word": false,
      "lstrip": false,
      "rstrip": false,
      "normalized": false,
      "special": true
    },
    {
      "id": 3,
      "content": "<unk>",
      "single_word": false,
      "lstrip": false,
      "rstrip": false,
      "normalized": false,
      "special": true
    },
    {
      "id": 4,
      "content": "<mask>",
      "single_word": false,
      "lstrip": false,
      "rstrip": false,
      "normalized": false,
      "special": true
    }
  ],
  "normalizer": null,
  "pre_tokenizer": null,
  "post_processor": null,
  "decoder": null,
  "model": {
    "type": "BPE",
    "dropout": null,
    "unk_token": "<unk>",
    "continuing_subword_prefix": null,
    "end_of_word_suffix": null,
    "fuse_unk": false,
    "byte_fallback": false,
    "ignore_merges": false,
    "vocab": {
      "<pad>": 0,
      "<s>": 1,
      "</s>": 2,
      "<unk>": 3,
      "<mask>": 4,
      "#": 5,
      "(": 6,
      ")": 7,
      "-": 8,
      "1": 9,
      "2": 10,
      "3": 11,
      "4": 12,
      "5": 13,
      "6": 14,
      "7": 15,
      "8": 16,
      "9": 17,
      "=": 18,
      "B": 19,
      "C": 20,
      "F": 21,
      "I": 22,
      "N": 23,
      "O": 24,
      "P": 25,
      "S": 26,
      "b": 27,
      "c": 28,
      "n": 29,
      "o": 30,
      "p": 31,
      "s": 32,
      "": 33,
      "": 34,
      "": 35,
      "": 36,
      "": 37,
      "": 38,
      "": 39,
      "": 40,
      "": 41,
      "": 42,
      "": 43,
      "": 44,
      "": 45,
      "": 46,
      "": 47,
      "": 48,
      "": 49,
      "": 50,
      "": 51,
      "": 52,
      "": 53,
      "": 54,
      "": 55,
      "": 56,
      "": 57,
      "": 58,
      "": 59,
      "": 60,
      "": 61,
      "": 62,
      "": 63,
      "": 64,
      "": 65,
      "": 66,
      "": 67,
      "": 68,
      "": 69,
      "": 70,
      "": 71,
      "": 72,
      "": 73,
      "": 74,
      "": 75,
      "": 76,
      "": 77,
      "": 78,
      "": 79,
      "": 80,
      "": 81,
      "": 82,
      "": 83,
      "": 84,
      "": 85,
      "": 86,
      "": 87,
      "": 88,
      "": 89,
      "": 90,
      "": 91,
      "": 92,
      "": 93,
      "": 94,
      "": 95,
      "": 96,
      "": 97,
      "": 98,
      "": 99,
      "": 100,
      "": 101,
      "": 102,
      "": 103,
      "": 104,
      "": 105,
      "": 106,
      "cc": 107,
      "CC": 108,
      "O)": 109,
      "c1": 110,
      "C(": 111,
      "=O)": 112,
      "c(": 113,
      "c2": 114,
      "C)": 115,
      "c1cc": 116,
      "C(=O)": 117,
      "c3": 118,
      "c2cc": 119,
      ")cc": 120,
      "(=O)": 121,
      "(C)": 122,
      "C1": 123,
      "c1ccc(": 124,
      "CCCC": 125,
      "c3cc": 126,
      "CO": 127,
      "2)": 128,
      "F)": 129,
      "CN": 130,
      "c1cccc": 131,
      "C(=O)N": 132,
      "C2": 133,
      "c2cccc": 134,
      "cn": 135,
      ")cc1": 136,
      "CCN": 137,
      "c4": 138,
      "=C(": 139,
      "3)": 140,
      "CC1": 141,
      "n1": 142,
      "c2ccccc2": 143,
      "nc(": 144,
      "c2ccc(": 145,
      "C(C)": 146,
      "c1ccccc1": 147,
      "NC(=O)": 148,
      "c3cccc": 149,
      "N)": 150,
      "CC(": 151,
      "CC(=O)": 152,
      "CCO": 153,
      "S(=O)": 154,
      "S(=O)(=O)": 155,
      ")": 156,
      "CCN(": 157,
      "C3": 158,
      "O=C(": 159,
      "c3ccccc3": 160,
      "OC)": 161,
      "c1cc(": 162,
      "cccc": 163,
      "(F)": 164,
      "n2": 165,
      "C=": 166,
      "CC(C)": 167,
      "c2c(": 168,
      "c1n": 169,
      "c3ccc(": 170,
      "cc1": 171,
      "cc(": 172,
      "Cc1ccc(": 173,
      "C(F)": 174,
      "CC2": 175,
      "F)cc": 176,
      "c2)": 177,
      "CC(=O)N": 178,
      "c2n": 179,
      "c2ccccc2)": 180,
      "C(F)(F)": 181,
      ")cc": 182,
      "c(=O)": 183,
      "C(O)": 184,
      "c1cccc(": 185,
      ")N": 186,
      "COc1ccc(": 187,
      "4)": 188,
      "c2cc(": 189,
      "OC": 190,
      "=O": 191,
      "CCC(": 192,
      "=N": 193,
      "CCCN": 194,
      "(C": 195,
      "c(-": 196,
      "CCC": 197,
      "c1)": 198,
      "2)cc1": 199,
      "O=": 200,
      "N2": 201,
      "C(C": 202,
      "C(=O)O)": 203,
      "c4cccc": 204,
      "CC2)": 205,
      "c3c(": 206,
      "nc(-": 207,
      "Cc1": 208,
      "c2c1": 209,
      "C(=O)O": 210,
      "c3ccccc3)": 211,
      "C(C)(C)": 212,
      "c3)": 213,
      "c(C)": 214,
      "C(=": 215,
      "N1": 216,
      "c1ccccc1)": 217,
      "cs": 218,
      "(=O)": 219,
      "(=O)": 220,
      "c5": 221,
      "O=C(N": 222,
      "nn": 223,
      "CC3": 224,
      "C#": 225,
      "Cc1cc": 226,
      "(O)": 227,
      "c4cc": 228,
      "C(F)(F)F)": 229,
      "CN1": 230,
      "c(N": 231,
      "c12": 232,
      "cc2": 233,
      "2)c1": 234,
      "c4ccccc4": 235,
      "COC(=O)": 236,
      "CS": 237,
      "1)": 238,
      "n(": 239,
      "CN(": 240,
      "c(O)": 241,
      "CC3)": 242,
      "c3n": 243,
      "CCC2": 244,
      "CC(O)": 245,
      "c2cccc(": 246,
      "S(=O)(=O)N": 247,
      "n3": 248,
      "CCC1": 249,
      "CC)": 250,
      "c(OC)": 251,
      "nc(N": 252,
      ")cc1": 253,
      "Cn1": 254,
      "CCCCCCCC": 255,
      "2)CC1": 256,
      "co": 257,
      "COc1cc(": 258,
      "CN(C)": 259,
      ")cc2": 260,
      "C(=O)N1": 261,
      "F)cc1": 262,
      "C(C)C)": 263,
      "C4": 264,
      "C(N)": 265,
      "nc2": 266,
      "Cc1cc(": 267,
      "c1ccc2c(": 268,
      "CCOC(=O)": 269,
      "c()": 270,
      "N=C(": 271,
      "c": 272,
      "C2)": 273,
      "Cc1ccccc1": 274,
      "c2cn": 275,
      "c1cc2": 276,
      "c1ccc(-": 277,
      "CNC(=O)": 278,
      "cc3": 279,
      "O=C1": 280,
      "c3cc(": 281,
      "CC(C)(C)": 282,
      "CCN1": 283,
      "N=": 284,
      "nc1": 285,
      ")": 286,
      "c2ccc()cc": 287,
      "c1cn": 288,
      "C3)": 289,
      "O=C(O)": 290,
      "C(C)=O)": 291,
      "N(": 292,
      "Cc1n": 293,
      "CCCCC1": 294,
      "CN2": 295,
      "c1O": 296,
      ")N1": 297,
      "(C)C)": 298,
      "C1O": 299,
      ")cc(": 300,
      ")cc2)": 301,
      "C(F)(F)F)cc": 302,
      "C(=O)N2": 303,
      "CCN(C(=O)": 304,
      "C(C)(C)C)": 305,
      "C1=O": 306,
      "(=O))": 307,
      "CCC3": 308,
      "cc2)": 309,
      "c1c(": 310,
      "cc(-": 311,
      "Cc2ccc(": 312,
      "c1ccc2c(c1)": 313,
      "NC(=O)N": 314,
      "ncn": 315,
      "N#": 316,
      "(=O)=O)": 317,
      "OC(=O)": 318,
      "OC(": 319,
      "o1": 320,
      "s1": 321,
      "c2nc(": 322,
      "CCCC1": 323,
      "C#N)": 324,
      "Cc1cccc(": 325,
      "CC4": 326,
      "c23)": 327,
      "c1nc(": 328,
      "CC2)cc1": 329,
      "OCO": 330,
      "=C(C)": 331,
      "c2)cc1": 332,
      "c1ccc()cc1": 333,
      "CC1)": 334,
      "c(F)": 335,
      "n2)cc1": 336,
      "NS(=O)(=O)": 337,
      "n2)": 338,
      "n(C)": 339,
      "3)cc1": 340,
      "cn1": 341,
      "c2": 342,
      "c1=O": 343,
      "c21": 344,
      "O)cc1": 345,
      "c3cccc(": 346,
      "c2ccc(F)cc": 347,
      "P(=O)": 348,
      "c4ccc(": 349,
      "OC1": 350,
      "C(=S": 351,
      "5)": 352,
      "CCn1": 353,
      "CC=": 354,
      "nc3": 355,
      "cc3)": 356,
      "C2=O)": 357,
      "N3": 358,
      "C(CO)": 359,
      "c1cccc2": 360,
      "C(=O)NC(": 361,
      "COc1cccc(": 362,
      "c1-": 363,
      "c2ccc3c(": 364,
      "CCNC(=O)": 365,
      "CCC4": 366,
      "n(-": 367,
      "c2ccccc21": 368,
      "COc1ccccc1": 369,
      "C=C": 370,
      "c2ccc(-": 371,
      "CC(=O)O)": 372,
      "c2ccccc2)cc1": 373,
      "CCN(C": 374,
      ")cc3)": 375,
      "CO)": 376,
      "Cc1ccc(-": 377,
      "C(N)=O)": 378,
      "c4ccccc4)": 379,
      "c4)": 380,
      "CCCO": 381,
      "c2cc3": 382,
      "COc1ccc(-": 383,
      "c(=O)": 384,
      "n3)": 385,
      "c2=O)": 386,
      "S(C)": 387,
      "c2n1": 388,
      "C(=O)N(": 389,
      "C2CCCC": 390,
      "c3ccc()cc": 391,
      "c4c(": 392,
      "C12": 393,
      "C(=N)": 394,
      "c3ccc(F)cc": 395,
      "CCCN(": 396,
      "C)cc1": 397,
      "CCCN1": 398,
      "c3cn": 399,
      "CCC(C)": 400,
      ")cc3": 401,
      "C#N": 402,
      "CC4)": 403,
      "Nc1n": 404,
      ")": 405,
      "c1ccc(O": 406,
      "c1ccc(F)cc1": 407,
      "NC(=O)C(": 408,
      "n1)": 409,
      "c2ccc3c(c2)": 410,
      "c2cccn": 411,
      "CCN(C)": 412,
      "CC(=O)O": 413,
      "S)": 414,
      "c2ccc()cc2)": 415,
      "CCS": 416,
      "OC)c(OC)": 417,
      "C2)cc1": 418,
      "c(N)": 419,
      "c1ccc(N": 420,
      "c2nc(-": 421,
      "C(=S)N": 422,
      "CC1(C)": 423,
      "ncc": 424,
      "c5cccc": 425,
      "()": 426,
      "S(C)(=O)=O)": 427,
      "C=N": 428,
      "CCN2": 429,
      "c1OC": 430,
      "CCCC2": 431,
      "Cn2": 432,
      "CCN(CC)": 433,
      "CCCC(": 434,
      "C5": 435,
      "c(O": 436,
      "C(O)C(O)": 437,
      "c1cc(-": 438,
      "C(O": 439,
      "P(=O)(O)": 440,
      "CC(C)C)": 441,
      "COc1cc2": 442,
      "3)cc": 443,
      "c(C)c1": 444,
      "nn1": 445,
      "CCC(=O)N": 446,
      "c2)c1": 447,
      "c12)": 448,
      "CC(=O)N1": 449,
      "N(C)": 450,
      "c2cc(-": 451,
      "C2(": 452,
      "O1": 453,
      "3CCCC": 454,
      "c(C(=O)N": 455,
      "cn2": 456,
      "#N)": 457,
      "c2ncn": 458,
      "C=C(": 459,
      "C1=": 460,
      "C(=O)C(": 461,
      "Cc2ccccc2)": 462,
      "nc(C)": 463,
      "S(=O)(=O)N2": 464,
      "c2ccccc12": 465,
      "CCO)": 466,
      ")c()": 467,
      "n(C": 468,
      "(-": 469,
      "c2s": 470,
      "cs1": 471,
      "C1)": 472,
      "no": 473,
      "Cc1cc(C)": 474,
      "cnc1": 475,
      "CN(C": 476,
      "c2cc1": 477,
      "Cc1cn": 478,
      "NC(": 479,
      "ncc1": 480,
      "CC(NC(=O)": 481,
      "CCOCC2)": 482,
      "C(Cc1ccccc1)": 483,
      "=C(O)": 484,
      "c2ccc(O": 485,
      "C4)": 486,
      "c2ncc": 487,
      "CS(=O)(=O)": 488,
      "c3ccc(F)cc3)": 489,
      "COc1cc": 490,
      "c1nc(-": 491,
      ")ccc1": 492,
      ")c1": 493,
      "O)cc": 494,
      "CCC(O)": 495,
      "OCCO": 496,
      "c2cccc3": 497,
      "c3": 498,
      "C1(": 499,
      "CC(N)": 500,
      "nc2c1": 501,
      "SCC(=O)N": 502,
      "c3cccn": 503,
      "c2ccc(F)cc2)": 504,
      "n": 505,
      "C1CCCCC1": 506,
      "c5ccccc5": 507,
      "C3CCCC": 508,
      "n4": 509,
      ")cc1": 510,
      "CCOCC1": 511,
      "CN(C(=O)": 512,
      "c34)": 513,
      "c2ccc(C)": 514,
      "CCOc1ccc(": 515,
      "Cc1c(": 516,
      "C1(C)": 517,
      "c1c": 518,
      "OC2": 519,
      "c3ccc()cc3)": 520,
      "C(O)=N": 521,
      "CCOCC3)": 522,
      "C=C1": 523,
      "cc(C)": 524,
      "ccc(": 525,
      "c2o": 526,
      "O=c1": 527,
      "c2)CC1": 528,
      "c2ccc()cc2": 529,
      "cccc2": 530,
      "c4cc(": 531,
      "N=C(N)": 532,
      "(N)": 533,
      "nc(N)": 534,
      "O=S(=O)": 535,
      "cc4": 536,
      "c2nc3ccccc3": 537,
      ")cc(OC)": 538,
      "c2c(C)": 539,
      "Cc2ccccc2": 540,
      "c(cc1": 541,
      "C1CCN(": 542,
      "CCCC(=O)": 543,
      "c2ccco": 544,
      "CCCN2": 545,
      ")cc2)cc1": 546,
      "C(F)(F)F)cc1": 547,
      "cccc1": 548,
      "CSc1n": 549,
      "CC12": 550,
      "c3ccccc23)": 551,
      "c2cc()cc": 552,
      "C2=N": 553,
      "C(C)C": 554,
      "CC2)c1": 555,
      "c1cccc(-": 556,
      "n1-": 557,
      "cccn": 558,
      "c1s": 559,
      "c2cccc()": 560,
      "CC(F)": 561,
      "c23)cc1": 562,
      ")c(": 563,
      "c2cccs": 564,
      "(=O))cc1": 565,
      "C3=O)": 566,
      "c6": 567,
      "C(=O)OC)": 568,
      "C=C2": 569,
      "c2ccn": 570,
      "O=S(=O)(": 571,
      "CN3": 572,
      "C(=O)NC": 573,
      "CCC2(": 574,
      "N=C(O)": 575,
      "CN1CCN(": 576,
      "c2nc(N": 577,
      "ccc3": 578,
      "OCC": 579,
      "C2=O": 580,
      "c2ccccc2)CC1": 581,
      "()": 582,
      "c2ccc(O)": 583,
      "c2c": 584,
      "CC1(": 585,
      "c2c(c1)": 586,
      "c3ccc(-": 587,
      "C(=N": 588,
      "NC": 589,
      "c3ccc4c(": 590,
      "c(NC(=O)": 591,
      "C(=O)C2": 592,
      "co1": 593,
      "c1ccc(NC(=O)": 594,
      "2)C1": 595,
      "C1=N": 596,
      "3C)": 597,
      "(C(F)(F)F)": 598,
      "CCC(=O)O)": 599,
      "c2-": 600,
      "C(NC(=O)": 601,
      "cc2)cc1": 602,
      "C2=O)cc1": 603,
      "c3ccn": 604,
      "c2nnc(": 605,
      "n2)c1": 606,
      "()": 607,
      "C2O": 608,
      "n2cn": 609,
      "(O": 610,
      "N4": 611,
      "(C)C": 612,
      "c1C": 613,
      ")ccc2": 614,
      "C(F)(F)F": 615,
      "O=()": 616,
      "=C1": 617,
      "CCc1n": 618,
      "c1c(C)": 619,
      "S(N)": 620,
      "c3ccc(C)": 621,
      "CCS(=O)(=O)": 622,
      "c1ccc(N2": 623,
      "C(=O)OC": 624,
      "c2c(-": 625,
      "nn2": 626,
      "N1CCN(": 627,
      "c3cc4": 628,
      "N(C": 629,
      "CCCn1": 630,
      "nc12": 631,
      "c(OC)c1": 632,
      "CCCC(C)": 633,
      "c2ccc(OC)": 634,
      "N(C)C)": 635,
      "Cc1cc2": 636,
      "c3c2": 637,
      "S(N)(=O)=O)": 638,
      "O)c(O)": 639,
      "c(=": 640,
      "1": 641,
      "CC(O": 642,
      "s2)": 643,
      ")ccc1O": 644,
      "c3ccc(O": 645,
      "NC(=O)C1": 646,
      "C(O)C1O": 647,
      "C(=O)O)cc1": 648,
      "c1nc(N": 649,
      "c2cs": 650,
      "CCCCC2)": 651,
      ")cc(OC)c1OC": 652,
      "C(=O)N3": 653,
      "c2ccccc2c1": 654,
      "C3CC3)": 655,
      "Cc1ccc()cc1": 656,
      "c3ccc4c(c3)": 657,
      "CN1C(=O)": 658,
      "C(=N)N": 659,
      "Cc1ccccc1)": 660,
      "c2ccccc2)c1": 661,
      "C1CC1": 662,
      "C(=O)N(C)": 663,
      "C=CC(=O)": 664,
      "c2ccc(": 665,
      "CCC)": 666,
      "CC(=O)N2": 667,
      "c2ccccc12)": 668,
      "c(=O)n2": 669,
      "c1ccccc1-": 670,
      "C1CCC2": 671,
      "c3ccco": 672,
      "C1=O)": 673,
      "C(C(=O)N": 674,
      "CCC12": 675,
      "s1)": 676,
      "no1": 677,
      "=C(N)": 678,
      "(C)C3": 679,
      "C=C(C)": 680,
      "C2CC2)": 681,
      "CCCNC(=O)": 682,
      "Cc3ccccc3": 683,
      "c2cc(C)": 684,
      "c1cccnc1": 685,
      "CCc1ccc(": 686,
      "CC(F)(F)": 687,
      "c(C(=O)O)": 688,
      "c1c(O)": 689,
      "OCC1": 690,
      "c2c(=O)": 691,
      "ccc2": 692,
      ")ccc3": 693,
      "c1ccc()cc1": 694,
      "C(=O)NC(C": 695,
      "c1": 696,
      "C2O)": 697,
      "Cc1ccc(O": 698,
      "n2cc": 699,
      "c2=O)cc1": 700,
      ")N(": 701,
      "c2)n1": 702,
      "o2)cc1": 703,
      "N2CCN(": 704,
      "c3ncn": 705,
      "c(F)c1": 706,
      "CCCCO": 707,
      "CCN3": 708,
      "c(S": 709,
      "CC(CC(": 710,
      "c1cc()cc": 711,
      "NC(=O)C2": 712,
      "CC(=": 713,
      "Cc1nc(": 714,
      "Cc3ccccc3)": 715,
      "c3ccc(O)": 716,
      "1": 717,
      "c4cn": 718,
      "CCc1ccccc1": 719,
      "c2ccc(N": 720,
      "C(N": 721,
      "c3cc()cc": 722,
      "CCOC(=O)C1": 723,
      "CCC3(C)": 724,
      "CC(C)(C)O": 725,
      "ccc1": 726,
      "cc(OC)": 727,
      "C2)c1": 728,
      "CC5": 729,
      "c(N3": 730,
      "Cc1ccc2c(c1)": 731,
      "c(-c2ccccc2)": 732,
      "c1ccncc1": 733,
      "c()c1": 734,
      "c3ccco3)": 735,
      "ncc2": 736,
      "C(OC(C)=O)": 737,
      "OC3": 738,
      "CC(=O)N(": 739,
      "COc1ccc(C2": 740,
      "O)cc1)": 741,
      "c1cccc(F)": 742,
      "C1CCC(": 743,
      "C(F)(F)F)c1": 744,
      "3)cc2": 745,
      "c2cccc(F)": 746,
      "c1nc2ccccc2": 747,
      "Cc1ccc(F)cc1": 748,
      "c2ccco2)": 749,
      "C(=C": 750,
      "cc(O)": 751,
      "4CCCC": 752,
      "COC(=O)C1": 753,
      "CC(N": 754,
      "Cn1c(=O)": 755,
      "c1ncc": 756,
      "n2)CC1": 757,
      "c3cccc4": 758,
      "cs3)": 759,
      "c()": 760,
      ")N1CCN(": 761,
      "=C2": 762,
      "s2)cc1": 763,
      "CC(=N": 764,
      "OC)cc1": 765,
      "O=C(C=": 766,
      "S1": 767,
      "C(C)(": 768,
      "Nc1nc(": 769,
      "CCCCCCCCCCCC": 770,
      "C2CCN(": 771,
      "OCO3)": 772,
      "CC2(": 773,
      "(CO)": 774,
      "CC=C(C)": 775,
      "cccc3": 776,
      "(=O)=O": 777,
      "c2ccc3ccccc3": 778,
      "c2ccccc2-": 779,
      "c4ccc(F)cc": 780,
      "CC(C)=": 781,
      "Cc1ccc(NC(=O)": 782,
      "C(C#N)": 783,
      "c5cc": 784,
      "c3cccc()": 785,
      "-2": 786,
      "COC1": 787,
      "COc1ccc2c(c1)": 788,
      "Cn1cc(": 789,
      "s3)": 790,
      "c3ccccn3)": 791,
      "(=O))c1": 792,
      "CCC(=O)": 793,
      "cn2)": 794,
      "CCN1C(=O)": 795,
      "c2cc3c(": 796,
      "CC1CN(": 797,
      "O=C1N": 798,
      "c1ccccn1": 799,
      "CC(C)O": 800,
      "c1cccc()c1": 801,
      "c2cccs2)": 802,
      "c2ccc((=O)": 803,
      "sc1": 804,
      "Nc1ccc(": 805,
      "c2ccccn2)": 806,
      "OC)c(OC)c(OC)": 807,
      "N2C(=O)": 808,
      "C(C)=O": 809,
      "c2cccnc2)": 810,
      "o2)": 811,
      "c2C)": 812,
      "C(=O)NC1": 813,
      "c2ccc(N3": 814,
      "c2cccc(C(F)(F)F)": 815,
      "c2ccc(NC(=O)": 816,
      "N(C(=O)": 817,
      "c4n": 818,
      "c3ccc()cc3": 819,
      "c3nn": 820,
      "CC#": 821,
      "c1ccc()cc1)": 822,
      "c2ccc(F)cc2": 823,
      "P(=O)(O)O": 824,
      "CCCC2)": 825,
      "oc(": 826,
      "n4)": 827,
      "nc(S": 828,
      "C(CO)C(O)C(O)": 829,
      "c(C#N)": 830,
      "3)c1": 831,
      "P(=O)(O)O)": 832,
      "C2CCCCC2)": 833,
      "N=C": 834,
      "C(c2ccccc2)": 835,
      "c1ccccc1)c1ccccc1": 836,
      "CCCCC1)": 837,
      "CCCCN1": 838,
      "c(=O)n(": 839,
      "c2ccc(S(=O)(=O)N": 840,
      ")ccc21": 841,
      "CCC(NC(=O)": 842,
      "C2(C)": 843,
      "CN(C)C(=O)": 844,
      "O2": 845,
      "I)": 846,
      "C(C)(C)C": 847,
      "c2ccc3": 848,
      "C(CO": 849,
      "NC(=S)N": 850,
      "c3ccc(OC)": 851,
      "c4": 852,
      "c4ccc()cc": 853,
      "=CC(=O)": 854,
      "n1cn": 855,
      "c1cccc2cccc": 856,
      "c2ccccc2)": 857,
      "c1cccs1": 858,
      "CCC(O": 859,
      "cn1)": 860,
      "c(=O)o": 861,
      "c3cccnc3)": 862,
      "c2ccccc2n1": 863,
      "C(N)=O": 864,
      "cnc2": 865,
      "C=CC(=O)N": 866,
      "CCC2(C)": 867,
      "COc1cc(-": 868,
      "-c1ccccc1": 869,
      "C23": 870,
      "c2cccc(-": 871,
      "c(C(=O)": 872,
      "c1cs": 873,
      "CCOCC3": 874,
      "c2cc(F)cc": 875,
      "OCO2": 876,
      ")cc(-": 877,
      "nc21": 878,
      "COc1cc2c(cc1": 879,
      "c1ccc2": 880,
      "cn3)": 881,
      "C(=O)N(C": 882,
      "C(=N)N)": 883,
      "c(=O)n1": 884,
      "Cc1cc(-": 885,
      "c3ncc": 886,
      "c(=O)n(C)": 887,
      "c2ncc(": 888,
      "N=C1": 889,
      ")cc2)CC1": 890,
      "nc(O)": 891,
      "c2c(O)": 892,
      "C2)CC1": 893,
      "C(=O)C1": 894,
      "c3cccs3)": 895,
      "c3c(C)": 896,
      "Cn1cn": 897,
      "c3ccncc3)": 898,
      "NC1": 899,
      "c2cccc()c2)": 900,
      "F)c(F)": 901,
      "c2ccccc2F)": 902,
      ")cc21": 903,
      "c1ccc(-c2n": 904,
      "CCN(C)C)": 905,
      "COc1ccc(NC(=O)": 906,
      "c1ccco1": 907,
      "C(=O)NCC": 908,
      "COc1cc(OC)": 909,
      "CCOCC4)": 910,
      "sc2c1": 911,
      "c1ccc((=O))cc1": 912,
      "c3s": 913,
      "c2ccc(C(F)(F)F)cc": 914,
      "c(=O)c1=O": 915,
      "F)c(": 916,
      "CC(C)(": 917,
      "C(Cc2ccccc2)": 918,
      "C(OC(=O)": 919,
      "C2=C(": 920,
      "oc(-": 921,
      "c2ncccc2": 922,
      "c2ccncc2)": 923,
      "4)CC3)": 924,
      "C3(": 925,
      "O2)": 926,
      "C=O)": 927,
      "CC1=": 928,
      "c2nnn": 929,
      "CCOCC2)cc1": 930,
      "ncnc3": 931,
      "cs1)": 932,
      "C(=S)": 933,
      "(C)c1": 934,
      "C(C(=O)O)": 935,
      "C2CC3": 936,
      "CCCC3": 937,
      "c2ccc3c(c2)OCO3)": 938,
      "c2c()cc": 939,
      "c4ccccc34)": 940,
      "c3cccnc3": 941,
      "(=O)o": 942,
      "CCCC1)": 943,
      "N2CCOCC2)": 944,
      "c3ccccc32)": 945,
      "CCCN(C(=O)": 946,
      "c2nc(C)": 947,
      "c3ccc(": 948,
      "c2ccccc2)n1": 949,
      "C3CCCCC3)": 950,
      "c(O)c1": 951,
      "c3ccc(F)cc3": 952,
      "n2c(": 953,
      "S(=O)(=O)N1": 954,
      "(C#N)": 955,
      ")cc2)c1": 956,
      "c1ncn2": 957,
      "c2c(F)cc": 958,
      "F)cc2": 959,
      "c1nnc(": 960,
      "CC1=C(": 961,
      "ncc(": 962,
      "c2cccc3cccc": 963,
      "c1ccccc1)N": 964,
      "C(=O)Nc1ccc(": 965,
      "c3=O)": 966,
      "CCCCN": 967,
      "CCC(N)": 968,
      "CC2)CC1": 969,
      "c1cc(C)": 970,
      "CCN1CCN(": 971,
      "c1=O)": 972,
      "Cc1ccc(C(=O)N": 973,
      ")cc2": 974,
      "C=NNC(=O)": 975,
      "CC(=O)OC1": 976,
      "c2cc(O": 977,
      "Cc1cccc(-": 978,
      "S)N": 979,
      "CCOCC1)": 980,
      "(C)": 981,
      "Cc1ccc(S(=O)(=O)N": 982,
      "CCC(N": 983,
      "c3cc(C)": 984,
      "CCC=": 985,
      "CCCCCCCCCCCCCCCC": 986,
      "n2-": 987,
      "c3ccccc23)cc1": 988,
      ")cc": 989,
      "C2=": 990,
      "c1c(-": 991,
      "NC(=O)O": 992,
      "S(=O)(=O)c1ccc(": 993,
      ")c()c1": 994,
      "c2nnc(-": 995,
      "c3nc4ccccc4": 996,
      "c2nc3c(": 997,
      "c2cc3cccc": 998,
      "c1cccc(F)c1": 999,
      "c2c3c(": 1000,
      "C#N)cc1": 1001,
      "c2cc1OC": 1002,
      "C=Cc2ccc(": 1003,
      "c1ccc(F)cc1)": 1004,
      "c2c1)": 1005,
      "COc1cccc(-": 1006,
      "c2ccc(C(=O)N": 1007,
      "O=c1": 1008,
      "C(=O)N1CCN(": 1009,
      "c3cc(-": 1010,
      "CCC3(": 1011,
      "OC4": 1012,
      "C(=O)c1ccccc1": 1013,
      "CCC3)": 1014,
      "c1cccn": 1015,
      "NC(=O)CS": 1016,
      "CC5)": 1017,
      "c1cccc2c1": 1018,
      "C21": 1019,
      "co1)": 1020,
      "n2cc(": 1021,
      "C2C1": 1022,
      "c3ccccc32)cc1": 1023,
      "C(F)F)": 1024,
      "6)": 1025,
      ")cc12": 1026,
      "C3O": 1027,
      "OCO4)": 1028,
      "O=C(NC1": 1029,
      "2": 1030,
      "Cc1ccc(N": 1031,
      "nc2n1": 1032,
      "c3ccc(C(F)(F)F)cc": 1033,
      "ccn": 1034,
      "c(-c3ccccc3)": 1035,
      "c2ccc(-c3ccccc3": 1036,
      "C(=O)NC(Cc1ccccc1)": 1037,
      "O)c1": 1038,
      "c5ccccc5)": 1039,
      "CC(=O)Nc1ccc(": 1040,
      "O)c(": 1041,
      "CNS(=O)(=O)": 1042,
      "CC(C(=O)N": 1043,
      "c4ccccc43)": 1044,
      "-c1ccc(": 1045,
      "c1cn(": 1046,
      "c3cccc(F)": 1047,
      "c2)C1": 1048,
      "c1cc2cccc": 1049,
      "CC1OC(": 1050,
      "COc1ccc(OC)": 1051,
      "CCCN3": 1052,
      "c21": 1053,
      "n12": 1054,
      "CCOCCO": 1055,
      "N1C(=O)": 1056,
      "O=C(Nc1ccc(": 1057,
      "c2cc(NC(=O)": 1058,
      "C(=O)NC(C)": 1059,
      "3)CC1": 1060,
      "c2cc3c(cc2": 1061,
      "c2cc(S(=O)(=O)N": 1062,
      "c5c(": 1063,
      "c3ccc(C)cc3)": 1064,
      "c(C(F)(F)F)": 1065,
      "C3O)": 1066,
      "CN)": 1067,
      "c5ccc(": 1068,
      "c(=O)": 1069,
      "CCC(=O)O": 1070,
      "cc21": 1071,
      "4)cc3)": 1072,
      "c4c3": 1073,
      "c2ccc(O)cc2)": 1074,
      "P(=O)(O": 1075,
      "CCCN(C": 1076,
      "CCOc1ccccc1": 1077,
      "CCC2(CC1)": 1078,
      "FC(F)(F)": 1079,
      "C(=O)N1CCCC1": 1080,
      "COc1ccc(C(=O)N": 1081,
      "COc1ccc2c(": 1082,
      "CN1CCC(": 1083,
      "c1ncc(": 1084,
      "c(=S)": 1085,
      "C(=O)N1CCC(": 1086,
      "OCc1ccccc1)": 1087,
      "nn3": 1088,
      "S)=N": 1089,
      "N=C(N)N": 1090,
      "CCc2ccccc2)": 1091,
      "oc2c1": 1092,
      "o3)": 1093,
      "ncc3": 1094,
      "Cn3": 1095,
      "CCOc1cc(": 1096,
      "COc1ccc(N": 1097,
      "c2ccc()cc2)": 1098,
      "CCc1cc(": 1099,
      "C(O)(": 1100,
      "c3cc4c(": 1101,
      "CC(=O)NC(": 1102,
      "Cn1c(": 1103,
      "c1cc2ccccc12)": 1104,
      "c2ccc()c()": 1105,
      "c2cc()ccc2": 1106,
      "Oc1ccc(": 1107,
      "CC=C(": 1108,
      "Cc1ccc(C)": 1109,
      "c3cccc()c3)": 1110,
      "n2C)": 1111,
      "c2ccc(C)cc2)": 1112,
      "CCc2c(": 1113,
      "C(C)C)cc1": 1114,
      "on1": 1115,
      "c2ccc()cc2)": 1116,
      "Nc1ncn": 1117,
      "C(F)(F)F)cc(C(F)(F)F)": 1118,
      "CCc1ccccc1)": 1119,
      "CS(=O)(=O)N": 1120,
      "cc4)": 1121,
      "CCC43C)": 1122,
      "c1ncn": 1123,
      "CN2C(=O)": 1124,
      "CC1O": 1125,
      "n2cnc3c(": 1126,
      "c5)": 1127,
      "ccnc1": 1128,
      "CCCC3)": 1129,
      "nc(N3": 1130,
      "CC(N)=O)": 1131,
      "CC(F)(F)F)": 1132,
      "c1nc2c(": 1133,
      "Nc1ccccc1": 1134,
      "C#C": 1135,
      "c2cc(C(=O)N": 1136,
      "c4cccn": 1137,
      "Cc1no": 1138,
      "c2F)": 1139,
      "c2C1": 1140,
      "c3ccccc3)CC2)": 1141,
      "CCCC)": 1142,
      "c3c2)": 1143,
      "P(=O)(": 1144,
      "C(=O)OC(C)(C)C)": 1145,
      "CCCCC3)": 1146,
      "n2nc(": 1147,
      "nc2-": 1148,
      "nc2c(": 1149,
      "Cc1cs": 1150,
      "c3C)": 1151,
      "C3(C)": 1152,
      "CCCCC2": 1153,
      "c4cccc(": 1154,
      "OCc1ccccc1": 1155,
      "cn3": 1156,
      "cc12": 1157,
      "CCN(S(=O)(=O)": 1158,
      "CCn1c(": 1159,
      "CC(C)N": 1160,
      "CCn1cc(": 1161,
      "c2cc(N": 1162,
      "C()": 1163,
      "2)n1": 1164,
      "c1cccc(O": 1165,
      "c3c": 1166,
      "COc1cc2c(cc1OC)": 1167,
      "c3cc(O)": 1168,
      "c2ccc()cc2)cc1": 1169,
      "c34": 1170,
      "=C(N": 1171,
      "Cc1ccc(O)cc1)": 1172,
      "c(-c3ccc(": 1173,
      ")cc1)": 1174,
      ")cc4)": 1175,
      "C5(C)": 1176,
      "c3ccc4ccccc4": 1177,
      "c1ccc(C(=O)N": 1178,
      "c1N": 1179,
      "Cc2cc(": 1180,
      "Cc1nc(-": 1181,
      "CCC4(C)C3": 1182,
      "c1ccc(O)cc1": 1183,
      "CCCN1C(=O)": 1184,
      "c2nc(N)": 1185,
      "c1c()cc": 1186,
      "c1cc2c(": 1187,
      "CCC(C)(C)": 1188,
      "Cc1cccc": 1189,
      "c3nc(-": 1190,
      "O=S(=O)(N": 1191,
      "C5)": 1192,
      "c3o": 1193,
      "c2cn(": 1194,
      "CCC1(": 1195,
      "c2cc3ccccc23)": 1196,
      "CCCCn1": 1197,
      "CC2)n1": 1198,
      "ccc1O": 1199,
      "O=C(CSc1n": 1200,
      "ccc4": 1201,
      "CN2CCN(": 1202,
      "C(=O)OCC)": 1203,
      "CC(C)(O)": 1204,
      "CCCCC2)cc1": 1205,
      "CC21": 1206,
      "C=CC1": 1207,
      "CC2)C1": 1208,
      "C(C)(O)": 1209,
      "OC(C)(C)": 1210,
      "3)cc2)": 1211,
      "NC(=O)c1ccccc1": 1212,
      "C=CC(": 1213,
      "COc1ccc()cc1": 1214,
      ")cc4": 1215,
      "Cc1cc(N": 1216,
      "C(C)=": 1217,
      "c2ccc()": 1218,
      "c2ccc(C(=O)O)": 1219,
      "c2ccc(OC)cc2)": 1220,
      "CCCS": 1221,
      "c3ccccc3)": 1222,
      "c3cc(F)cc": 1223,
      "c2ccncc": 1224,
      "N=C2": 1225,
      "c2cccc3ccccc23)": 1226,
      "COc1ccc(C(=O)": 1227,
      "F)cccc1": 1228,
      "nc4": 1229,
      "C(N)=N": 1230,
      "nn(-": 1231,
      "c-2": 1232,
      "c4ccc(F)cc4)": 1233,
      "NC(=O)C(C": 1234,
      "Cc1cn(": 1235,
      "Cc1c": 1236,
      "CCOCC4": 1237,
      "2)": 1238,
      "nc2ccccc12": 1239,
      "c3ccc((=O)": 1240,
      "nc1-": 1241,
      "c1cc(F)cc": 1242,
      "c(=O)n3": 1243,
      "C4CCCC": 1244,
      "CCc3ccccc3": 1245,
      "c3c(F)cc": 1246,
      "c2c(c1": 1247,
      "C1CCCCC1)": 1248,
      "n3cn": 1249,
      "(": 1250,
      "C(F)(F)F)c3)": 1251,
      "C(CO)C(O)": 1252,
      "Cc1o": 1253,
      "NC(=O)c1ccc(": 1254,
      "CCC(=O)N1": 1255,
      "c2cc(F)": 1256,
      "c1nnc(-": 1257,
      "c1cc2c(cc1": 1258,
      "c3ccc(N4": 1259,
      "3CCCC3)": 1260,
      "Cc1c(-": 1261,
      "c1cccc(NC(=O)": 1262,
      "o1)": 1263,
      "C(C)CO)": 1264,
      "cc1)": 1265,
      "CC(OC(=O)": 1266,
      "CC(CO)": 1267,
      "c3cc2": 1268,
      "c2ccs": 1269,
      "cc2)c1": 1270,
      "4CCOCC4)": 1271,
      "c3)cc2": 1272,
      "c2ccc3n": 1273,
      "c2cccc(O": 1274,
      "c(N2": 1275,
      "c1ccc2ccccc2c1": 1276,
      "CCCCN)": 1277,
      "c2n": 1278,
      "c2ccccc2)cc1)": 1279,
      "c3ccc(O)cc3)": 1280,
      "COC(": 1281,
      "n1cc(": 1282,
      "OCC2": 1283,
      "c3ccccc3F)": 1284,
      "c1cccc2ccccc12": 1285,
      "C1=C(": 1286,
      "C1CCCC1": 1287,
      "c3ccc(N": 1288,
      "c2c1=O": 1289,
      "c(S(=O)(=O)N": 1290,
      "CN=C(O)": 1291,
      "c3ccc4c(c3)OCO4)": 1292,
      "3CCCCC3)": 1293,
      "C1)C2": 1294,
      "C1CC2": 1295,
      "c1cccc(N": 1296,
      "CCc2ccccc2": 1297,
      "CCCCNC(=O)": 1298,
      "c1ccccc1O": 1299,
      "Cc2c(": 1300,
      "N1CCC(": 1301,
      "c2ccc3": 1302,
      "COc1ccc(S(=O)(=O)N": 1303,
      "c1nc(C)": 1304,
      "CCCC(=O)N": 1305,
      "nc2)": 1306,
      "SC)": 1307,
      "Cc1ccco1": 1308,
      "COC(=O)c1ccc(": 1309,
      "C3CCCC3)": 1310,
      "C(=O)C=": 1311,
      "CN2CCC(": 1312,
      "Cc1cc(C)cc(": 1313,
      "CN(C)C)": 1314,
      "C2C3": 1315,
      "c2cccc(C(F)(F)F)c2)": 1316,
      "C=NN": 1317,
      "nc2ccccc21": 1318,
      "c2cccc((=O))": 1319,
      "C2CCC1": 1320,
      "C(=O)N2CCN(": 1321,
      "c1ccccc1": 1322,
      "C(=Cc2ccc(": 1323,
      "Cc1": 1324,
      "nn2)": 1325,
      "C3)cc1": 1326,
      "CC)": 1327,
      "C5CCC43C)": 1328,
      "OCc2ccccc2)": 1329,
      "c3ccc(OC)cc3)": 1330,
      "c4ccc(O)": 1331,
      "c1cccc(C(F)(F)F)c1": 1332,
      "Cc1ccccc1)N": 1333,
      "c3nc(": 1334,
      "CC3CC(CC(": 1335,
      "CNC(=O)N": 1336,
      "C(=NO)": 1337,
      "S2": 1338,
      "SC": 1339,
      "cn2)cc1": 1340,
      "c2)": 1341,
      "OCC(=O)N": 1342,
      "CCCCN(": 1343,
      "c1cc(N": 1344,
      "c2cccc(C)": 1345,
      "CC(C)CC(NC(=O)": 1346,
      "c1ccccn1)": 1347,
      "c2cc(=O)": 1348,
      "S(C)(=O)=O": 1349,
      "S(=O)(=O)c1ccccc1": 1350,
      "COc1c(": 1351,
      "c((=O))": 1352,
      "C2)C1": 1353,
      "()": 1354,
      "()": 1355,
      "N#Cc1ccc(": 1356,
      "c2cccc(F)c2)": 1357,
      "c2C)cc1": 1358,
      "c13)": 1359,
      "c2nc(N3": 1360,
      "C1O)": 1361,
      "c1ccc(-n2": 1362,
      ")N1CCC(": 1363,
      "n1-c1ccccc1": 1364,
      "n1C": 1365,
      "c2ccc()cc2)CC1": 1366,
      "c2cccc(O)": 1367,
      "C4CC4)": 1368,
      "OCO4": 1369,
      "c3cc4c(cc3": 1370,
      "n(-c2ccccc2)": 1371,
      "c1cccnc1)": 1372,
      "c2c(F)cccc2": 1373,
      "C3=N": 1374,
      "CC3CC(CC(C3)": 1375,
      "c(=O)c(C(=O)O)": 1376,
      "C2CCCC2)": 1377,
      "O=C(NN=": 1378,
      "COCCO": 1379,
      "O3)": 1380,
      "C(CCC4": 1381,
      "c1c2c(": 1382,
      "NC1=O": 1383,
      "CCC12C": 1384,
      "c2cc(OC)": 1385,
      "CCC5": 1386,
      "nc(NC(=O)": 1387,
      "c4ccc()cc4)": 1388,
      "c2nc(-c3ccccc3)": 1389,
      "c3cc()ccc3": 1390,
      "c(=O)1": 1391,
      "Cc1cccc2": 1392,
      "c1cc(O)": 1393,
      ")c1": 1394,
      "CCc3ccccc3)": 1395,
      "CCCC(C)=": 1396,
      "C2=O)c1": 1397,
      "C(=O)c2ccccc2": 1398,
      "cc2c1": 1399,
      "C(=O)NC2": 1400,
      "ncnc32)": 1401,
      "COc1cccc2": 1402,
      "CC(C)CC(": 1403,
      "Cc2ccc(F)cc": 1404,
      "c2c(N)": 1405,
      "(c2ccccc2)": 1406,
      "C)c1": 1407,
      "c(C": 1408,
      "CCCO)": 1409,
      "C3CCC4": 1410,
      "ncn1": 1411,
      "OCC1OC(": 1412,
      "c2cc(OC)c(OC)c(OC)": 1413,
      "oc(=O)": 1414,
      "c1ccccc12": 1415,
      "c3cccc(F)c3)": 1416,
      "CC1(O)": 1417,
      "c1ncccc1": 1418,
      "c2ccccc2c1=O": 1419,
      "c1ccc(C(F)(F)F)cc1": 1420,
      "ccn1": 1421,
      "Cn1cc(-": 1422,
      "sc3": 1423,
      "O=C(O": 1424,
      "3CCCCC3": 1425,
      "COC(=O)N": 1426,
      ")cc(": 1427,
      "nn2)cc1": 1428,
      "cnc3": 1429,
      "C(C)N": 1430,
      "c2c1": 1431,
      "c3ccccc3)cc2": 1432,
      "c3ccc()cc3)": 1433,
      "c2cccnc2": 1434,
      "nn12": 1435,
      "c1ccc(-c2cn": 1436,
      "Cc1ccc(S(=O)(=O)N2": 1437,
      "N(C)C(=O)": 1438,
      "4)cc3": 1439,
      "Cc1ccccc1-": 1440,
      "c4ccco": 1441,
      "c2ccc(C#N": 1442,
      "c3c()cc": 1443,
      "c4ccncc": 1444,
      "CC1=N": 1445,
      "COc1ccccc1-": 1446,
      "CC(C(=O)O)": 1447,
      "C(=O)N2CCC(": 1448,
      "CC4CC(CC(": 1449,
      "c4ccccc4)CC3)": 1450,
      "O=C(COC(=O)": 1451,
      "n(-c3ccccc3)": 1452,
      "c2ccc((=O))cc2)": 1453,
      "c4ccccc4)cc3)": 1454,
      "C(Cc1ccccc1)NC(=O)": 1455,
      "c2no": 1456,
      "CN4": 1457,
      "CCC2)": 1458,
      ")ccc1-": 1459,
      "cnc2c1ncn2": 1460,
      "2)cc1": 1461,
      "1)": 1462,
      "C6": 1463,
      "N2CCC(": 1464,
      "N)cc1": 1465,
      "CC2)ccc1": 1466,
      "S(=O)(=O)O)": 1467,
      "CC2=O)": 1468,
      "CCC=C(C)": 1469,
      "COc1cc(C2": 1470,
      "C(CC(C)C)": 1471,
      "c3ccc()c()": 1472,
      ")N2": 1473,
      "o2)c1": 1474,
      "N=C(C)": 1475,
      "c2ccc3ccccc3c2)": 1476,
      "C(S)=N": 1477,
      "c2ccccc2)C1": 1478,
      "c1cc()ccc1": 1479,
      "CCn2": 1480,
      "C2CCC(": 1481,
      "c(": 1482,
      "NC(=O)CO": 1483,
      "CN(C)c1ccc(": 1484,
      "N1CCOCC1": 1485,
      "c3ccc(C(F)(F)F)cc3)": 1486,
      "CCNCC3)": 1487,
      "c2ccc(OC": 1488,
      "CC3)cc2": 1489,
      "cn2)CC1": 1490,
      "ccc12": 1491,
      "CC1CCCO": 1492,
      "C1(C)C": 1493,
      "c1cc2cc(": 1494,
      "n2c1": 1495,
      "O=C1c2ccccc2": 1496,
      "c-": 1497,
      "c3ccc(C(=O)N": 1498,
      "nn3)": 1499,
      "C(C(=O)": 1500,
      "c3ccccc3)cc2)": 1501,
      "CC(O)(": 1502,
      "N=C(N": 1503,
      "O=C(CN1": 1504,
      "C(C)(C)C)cc1": 1505,
      "n2C": 1506,
      "c1nc(-c2ccccc2)": 1507,
      "c45)": 1508,
      "c1ccc(": 1509,
      "C(=O)O1": 1510,
      "(CC)": 1511,
      "C(C)O": 1512,
      "OC)c1": 1513,
      "c2cc(N3": 1514,
      "CC4CC(CC(C4)": 1515,
      "COc1cc(N": 1516,
      "C3=": 1517,
      "CCCCCC": 1518,
      "C2C": 1519,
      "c1ccc2c(c1)OCO2": 1520,
      "nnc1-": 1521,
      "c2ccc(F)cc2)CC1": 1522,
      "c6cccc": 1523,
      "3)": 1524,
      "c1ccc(C)cc1": 1525,
      "nnc1": 1526,
      "c2ccc(F)cc2)cc1": 1527,
      "Cc1cccnc1": 1528,
      "Cc1ccc()cc1)": 1529,
      "CC=C(C)C)": 1530,
      "c2cc(O)": 1531,
      "Cc1s": 1532,
      "C1CO": 1533,
      "CC2CC2)": 1534,
      ")c1)": 1535,
      "3)cc2)cc1": 1536,
      "ccc(-": 1537,
      "CCCC2)cc1": 1538,
      "(CC(=O)N": 1539,
      "C(=O)OCC(=O)N": 1540,
      "F)c()": 1541,
      "ncn2": 1542,
      "=S)": 1543,
      "c2=O)c1": 1544,
      "C1C": 1545,
      "CCNS(=O)(=O)": 1546,
      "c2cc1O": 1547,
      "C2(O)": 1548,
      ")ccn1": 1549,
      "NC(=O)C(CC(C)C)": 1550,
      "c1o": 1551,
      "c2c()cccc2": 1552,
      "s2)c1": 1553,
      "c1ccc2c(c1": 1554,
      "c3)cc": 1555,
      "c1nc(N)": 1556,
      "c43)": 1557,
      "C(C)(C)C5CCC43C)": 1558,
      "COc1ccc(-c2n": 1559,
      "c3cccc4cccc": 1560,
      "CNC": 1561,
      "c1ccc(OC)cc1": 1562,
      "CCNCC1": 1563,
      "C(c1ccccc1)": 1564,
      "C(=O)N(C)C)": 1565,
      "C2)n1": 1566,
      "c3c(-": 1567,
      "CC1CCCCC1)": 1568,
      "CC4CC(CC(C4)C2)": 1569,
      "c4ncc": 1570,
      "C=C3": 1571,
      "nc1N": 1572,
      "CC(O)C(O)": 1573,
      "CCCCCC1": 1574,
      "c2cncc": 1575,
      "CCn1c(=O)": 1576,
      "c2co": 1577,
      "N2CCN(C(=O)": 1578,
      "c2cnn3": 1579,
      "C=C2S": 1580,
      "c1ccco1)": 1581,
      "C(=O)NS(=O)(=O)": 1582,
      "c1ccccc1)": 1583,
      "CCN)": 1584,
      "cccc4": 1585,
      "c1ccc(S(=O)(=O)N": 1586,
      "c1ccc2c(c1)OCCO": 1587,
      "c3cccc(C)": 1588,
      "cc(N": 1589,
      "cc2c(": 1590,
      "CCCN(CCC)": 1591,
      "c1ccccc1)N1": 1592,
      "C(=O)C(C)": 1593,
      "CCCNC(=N)N)": 1594,
      "(Cc2ccccc2)": 1595,
      "Cc1ccc(F)cc1)": 1596,
      "c3ccc(NC(=O)": 1597,
      "Cc1nn(C)": 1598,
      "O=C(O)C1": 1599,
      "CC(C)C(": 1600,
      "c1cccc2ccccc12)": 1601,
      "CCN2C(=O)": 1602,
      "c4ccccn4)": 1603,
      "=C(N)N)": 1604,
      "c2n(": 1605,
      "NC(=O)C(N)": 1606,
      "CC(O)CO": 1607,
      "c3cccc(C(F)(F)F)c3)": 1608,
      "c3ncccc3": 1609,
      "c1cc(-c2ccccc2)": 1610,
      "N=C(S)N": 1611,
      "COc1ccc(O": 1612,
      "c2cccc(OC)": 1613,
      "cc()": 1614,
      "CC3(": 1615,
      "c(=O)c2c1": 1616,
      "Cc1ccc(-n2": 1617,
      "Cc1nc(N": 1618,
      "c2O)": 1619,
      "Cc2ccc(-": 1620,
      "c(NC": 1621,
      "C(O)C(O)C1O": 1622,
      "c(=N)": 1623,
      "c23)CC1": 1624,
      "CCN(CC)C(=O)": 1625,
      "c3ccccc3)cc": 1626,
      "c3ccncc3": 1627,
      "c1ccc(F)": 1628,
      "C2CC(": 1629,
      "CCC21": 1630,
      "n5": 1631,
      "CC1CCC(": 1632,
      "Cc1c(C)": 1633,
      "OC(CO": 1634,
      "c2ccnc(N": 1635,
      "CCCN(C)C)": 1636,
      ")c1ccccc1": 1637,
      "c1ccc2o": 1638,
      "C1CC": 1639,
      "CCCCCCN": 1640,
      "CC2CCCO": 1641,
      "O=C(CS": 1642,
      "c1cc()": 1643,
      "Cc1ccncc1": 1644,
      "c4ccc5c(": 1645,
      "c23)c1": 1646,
      "c4ccc(C)": 1647,
      "c2ccc()c()c2)": 1648,
      "nc3ccccc3": 1649,
      "C(=O)OCC": 1650,
      "nc3)": 1651,
      "CCN(C)CC3)": 1652,
      "c4cc()cc": 1653,
      "c2ccc(C(F)(F)F)cc2)": 1654,
      "Cc1ccc((=O))cc1": 1655,
      "c(=O)n(-": 1656,
      "Cn1cc": 1657,
      "Cc1ccc(S(=O)(=O)": 1658,
      "c(O)c(": 1659,
      "c1c(F)cccc1": 1660,
      "CN(C)S(=O)(=O)": 1661,
      "C4=O)": 1662,
      "CCC(CC)": 1663,
      "c4c3)": 1664,
      "CCCN(C)": 1665,
      "c1ccc()": 1666,
      "CCC(C(=O)N": 1667,
      "(C4": 1668,
      "c4ccc(-": 1669,
      "OCO2)": 1670,
      "c2s1": 1671,
      "c1ccc(F)cc1F": 1672,
      "c2ccc3c(c2)OCCO": 1673,
      "N1CCN(C(=O)": 1674,
      "nn(C)": 1675,
      "c1cncc(": 1676,
      "COc1ccc2": 1677,
      "c2nn": 1678,
      "c3cco": 1679,
      "c1cccs1)": 1680,
      "5CCCC": 1681,
      "C34": 1682,
      "ncnc(N": 1683,
      "C(=O)O)c1": 1684,
      "CC1CCN(": 1685,
      "C)": 1686,
      "OO": 1687,
      "N(CC(=O)N": 1688,
      "c2ccccc21)": 1689,
      "c4ccc(N": 1690,
      "COc1ccc(CNC(=O)": 1691,
      "c3ccc()c()c3)": 1692,
      "c4ccc(OC)": 1693,
      "c3ccc(C#N": 1694,
      "CC2(C)": 1695,
      "C1(O)": 1696,
      "c(-c2ccc(": 1697,
      "CN1C(=O)C(": 1698,
      "c1cc(=O)": 1699,
      "c2c(N": 1700,
      "C(=O)NC(CC(C)C)": 1701,
      "CO1": 1702,
      "c(F)c2)": 1703,
      "c3c(F)cccc3": 1704,
      "Cc1ccc(O)cc1": 1705,
      "C12CC3CC(CC(C3)": 1706,
      "c((=O))c1": 1707,
      "CN=C(": 1708,
      "ccc2c1": 1709,
      "CC(C)C(NC(=O)": 1710,
      "n(CC(=O)N": 1711,
      "c3cc(OC)": 1712,
      "C(c3ccccc3)": 1713,
      "=C(C#N)": 1714,
      "C(C)C(=O)N": 1715,
      "CC(O)(C": 1716,
      "CCC1C2": 1717,
      "c2cccnc2)cc1": 1718,
      "c1ccc(OC": 1719,
      "C3CCN(": 1720,
      "C1OC(": 1721,
      "(C)": 1722,
      "Cc1cc()cc": 1723,
      "c1c(N": 1724,
      "c1ccc()c()c1": 1725,
      "CC1CC1)": 1726,
      "c1ccccc1F": 1727,
      "Cc1c(C(=O)N": 1728,
      "c(=O)c2=O)": 1729,
      "CCNC(=O)N": 1730,
      "c23": 1731,
      "CCOC(=O)N1": 1732,
      "c3F)": 1733,
      "C(C)O)": 1734,
      "C3(O)": 1735,
      "c2ccc()cc2)c1": 1736,
      "NC(=O)OC(C)(C)C)": 1737,
      "nc3c(": 1738,
      "CC(c2ccccc2)": 1739,
      "C(=O)NC(CC(=O)O)": 1740,
      "CCCCC(": 1741,
      "c1": 1742,
      "C4(C)": 1743,
      "c3cc4cccc": 1744,
      "NCC": 1745,
      "CC(OC(C)=O)": 1746,
      "Oc1ccccc1": 1747,
      "nc1C": 1748,
      "O=C(C1": 1749,
      "Fc1ccc(": 1750,
      "C(C)C)c1": 1751,
      "c3ccc(O)cc3": 1752,
      "c4cccc()": 1753,
      "c(=O)n(C": 1754,
      "=": 1755,
      "cc(C(=O)N": 1756,
      "c2ccc(O)cc2": 1757,
      "Cc2cn": 1758,
      "CO2": 1759,
      "c(=O)n2C": 1760,
      "c1cccc((=O))c1": 1761,
      "NC(=O)C(C)": 1762,
      "c2cc(C(F)(F)F)cc": 1763,
      "CCC(O)(": 1764,
      "C(F)(F)F)cc2": 1765,
      "CC3)cc": 1766,
      "(C)(C)": 1767,
      "C(OC)": 1768,
      "c3cs": 1769,
      "OCCCC": 1770,
      "SC1=": 1771,
      "CC(=O)NC1": 1772,
      "OCC(": 1773,
      "OC(CO)C(O)C(O)": 1774,
      "c2cccc()": 1775,
      "n3C)": 1776,
      "c5cc(": 1777,
      "CCOC)": 1778,
      "C(C)=O)cc1": 1779,
      "=": 1780,
      "c4ccco4)": 1781,
      "NC(=O)C": 1782,
      "nc2)cc1": 1783,
      "c1ccc()cc1": 1784,
      "5CCO": 1785,
      "c1cn(-": 1786,
      "CC1CCCCC1": 1787,
      "ccc21": 1788,
      "c2ncn(": 1789,
      "Cc1cccc(C)c1": 1790,
      "OCO3": 1791,
      "c1ncc(-": 1792,
      "c3ccc()": 1793,
      ")N1CCOCC1": 1794,
      "cc1": 1795,
      "C(F)(F)F)cc1)": 1796,
      "n3cc": 1797,
      "c3cccc(-": 1798,
      "COc1ccccc1N1CCN(": 1799,
      "c()cc1": 1800,
      "COc1ccc(-n2": 1801,
      "c2ccco2)cc1": 1802,
      "CC3)cc1": 1803,
      "c3cc(OC)c(OC)c(OC)": 1804,
      "C3CCCCC3": 1805,
      "CC(=O)N(C)": 1806,
      "C(F)(F)F)c1)": 1807,
      "c4cc5": 1808,
      "c(=N": 1809,
      "c2cc()": 1810,
      "Cc1cccs1": 1811,
      "cc5": 1812,
      "c1cc(O": 1813,
      "CCCC4)": 1814,
      "c3ccc(C)cc3": 1815,
      "C(CC(=O)O)": 1816,
      "c1c(N)": 1817,
      "CC23": 1818,
      "COc1ccc(CN": 1819,
      ")cc3": 1820,
      "COc1ccc(S(=O)(=O)N2": 1821,
      "C=CC=": 1822,
      "CCN1CCC(": 1823,
      "c1ccc(-c2ccc(": 1824,
      "c2ccc(C)cc2)cc1": 1825,
      "C(C)(C)O)": 1826,
      "c1nn(-": 1827,
      "C2CO": 1828,
      "c2ccncc2": 1829,
      "CCOC(=O)C1=C(C)": 1830,
      "CC4)cc3)": 1831,
      "Cn2cn": 1832,
      "c2cc(O)cc": 1833,
      "NC(=N": 1834,
      "c3ccc((=O))cc3)": 1835,
      "OC(C)": 1836,
      "CC3CC3)": 1837,
      ")cc2)n1": 1838,
      "c2cc()cc()": 1839,
      "C(=O)C3": 1840,
      "C=CC(=O)O": 1841,
      "Cc1noc(C)c1": 1842,
      "C(=O)NO)": 1843,
      "c2cccs2)cc1": 1844,
      "CCCC4": 1845,
      "c2nc(O)": 1846,
      "CC#N)": 1847,
      "(=O))cc": 1848,
      "c3ccccc3)CC2)cc1": 1849,
      "CC(O)CN": 1850,
      "Cc2ccccc2)cc1": 1851,
      "C(=N)O)": 1852,
      "C1": 1853,
      "ncnc21": 1854,
      "c1cccc()c1)": 1855,
      "cnn2": 1856,
      "c3c(O)": 1857,
      "CC1CC1": 1858,
      "c1cn2": 1859,
      "nc(SCC(=O)N": 1860,
      "C(=O)Nc1ccccc1": 1861,
      "C2CC(O)": 1862,
      "C1CCC1": 1863,
      "c1-c1ccccc1": 1864,
      "c3ccc4": 1865,
      "3CCCC3": 1866,
      "C(C)=N": 1867,
      "COC(=O)C(": 1868,
      "cccn3)": 1869,
      "=C": 1870,
      "cc3c(": 1871,
      "c1nnn": 1872,
      "OCc3ccccc3)": 1873,
      "nnc(-": 1874,
      "cc(-c3ccccc3)": 1875,
      "CCCC2(C)": 1876,
      "CCNCC2)": 1877,
      "CC1CCC2": 1878,
      "Cn1nc(": 1879,
      ")N1CCCC1": 1880,
      "CC(C)C": 1881,
      "c1ccc(S(=O)(=O)N2": 1882,
      "c3ccccc3-": 1883,
      "c3ccc(C(=O)O)": 1884,
      "c2cccc(NC(=O)": 1885,
      "c2ccc()cc2": 1886,
      "Cc1c(O)": 1887,
      "CC1CO": 1888,
      "n(C)c1=O": 1889,
      "NC1=N": 1890,
      "3)C2": 1891,
      "4)cc": 1892,
      "c2c1cc": 1893,
      "CCCN=C(N)N)": 1894,
      "C(=S)N(": 1895,
      "CN(Cc1ccccc1)": 1896,
      "O=C(CCCC": 1897,
      "CC(=O)NC(C)": 1898,
      "C(=S)NC(=O)": 1899,
      "c3ccc(S(=O)(=O)N": 1900,
      "CCCN)": 1901,
      "c(NS(=O)(=O)": 1902,
      "(C)C)cc1": 1903,
      "c(F)cc2": 1904,
      "nc2s": 1905,
      "c2ccc(F)cc2F)": 1906,
      "cc2)CC1": 1907,
      "CCCCC3": 1908,
      "C(C)=C(": 1909,
      "CC(C)(C)C)": 1910,
      "CCCO3)": 1911,
      "C1CC(": 1912,
      ")c()c1)": 1913,
      "COc1ccc(CCNC(=O)": 1914,
      "c1ccn": 1915,
      "C=C(C#N)": 1916,
      "oc12": 1917,
      "c6ccccc6": 1918,
      "COc2ccc(": 1919,
      "n2n1": 1920,
      "N#CC1": 1921,
      "c3ccs": 1922,
      "CC(C)n1": 1923,
      "(C#": 1924,
      "Cc1ccc(-c2n": 1925,
      "Nc1nc(N)": 1926,
      ")N(C": 1927,
      "c2cccc3c2": 1928,
      "c2ccc((=O))cc2": 1929,
      "c2ccccn2)cc1": 1930,
      "Cc1cc(O)": 1931,
      "cn12": 1932,
      "N=N": 1933,
      "c21)": 1934,
      "c2ccccc2c1)": 1935,
      "cs2)cc1": 1936,
      "C1C2": 1937,
      "c2cc(-c3ccccc3)": 1938,
      "CCC3(CC2)": 1939,
      "O2)cc1": 1940,
      "Cc1ccc(OC": 1941,
      "c(CN": 1942,
      "cc(O": 1943,
      "oc1": 1944,
      "CCOC(": 1945,
      "no2)cc1": 1946,
      "c7": 1947,
      "NS(=O)(=O)c1ccc(": 1948,
      "CCC3(C)C(CCC4": 1949,
      "c2ccc(-c3n": 1950,
      "c4ccc5c(c4)": 1951,
      "c1ccccc1F)": 1952,
      "C23CC4CC(CC(C4)C2)": 1953,
      "c(F)c(F)": 1954,
      "C(F)(F)C(F)(F)": 1955,
      "c2c(OC)": 1956,
      "c1ccncc1)": 1957,
      "cc(OC)c1OC": 1958,
      "c2ccncc2)cc1": 1959,
      "nn1)": 1960,
      "n1": 1961,
      "Nc1nc(N": 1962,
      "n(Cc2ccccc2)": 1963,
      "c3ccc(OC(F)(F)F)cc": 1964,
      "=S": 1965,
      "cc1-": 1966,
      "C(O)C2O)": 1967,
      "nc(O": 1968,
      "CN1CCCC1": 1969,
      "c2ccccc2)CC1)": 1970,
      "CN1CCN(C(=O)": 1971,
      "c(C(N)=O)": 1972,
      "c1ccc2nc(": 1973,
      "nc(N2": 1974,
      "Cc1ccco1)": 1975,
      "Cn2cc(": 1976,
      "c1cccc(F)c1)": 1977,
      "c3cccc(O)": 1978,
      "C=C(C)C1": 1979,
      ")cc(C)": 1980,
      "3)C1": 1981,
      "c4cccs": 1982,
      "c2)cc1OC": 1983,
      "Cc1ccc(N2": 1984,
      "c1": 1985,
      "C(=O)c3ccccc3": 1986,
      "nn1-": 1987,
      "CC(=O)N1CCN(": 1988,
      "CCC=CCC=": 1989,
      "c4ccccc4)cc3": 1990,
      "NC(C)=O)": 1991
    },
    "merges": [
      [
        "c",
        "c"
      ],
      [
        "C",
        "C"
      ],
      [
        "O",
        ")"
      ],
      [
        "c",
        "1"
      ],
      [
        "C",
        "("
      ],
      [
        "=",
        "O)"
      ],
      [
        "c",
        "("
      ],
      [
        "c",
        "2"
      ],
      [
        "C",
        ")"
      ],
      [
        "c1",
        "cc"
      ],
      [
        "C(",
        "=O)"
      ],
      [
        "c",
        "3"
      ],
      [
        "c2",
        "cc"
      ],
      [
        ")",
        "cc"
      ],
      [
        "(",
        "=O)"
      ],
      [
        "(",
        "C)"
      ],
      [
        "C",
        "1"
      ],
      [
        "c1cc",
        "c("
      ],
      [
        "CC",
        "CC"
      ],
      [
        "c3",
        "cc"
      ],
      [
        "C",
        "O"
      ],
      [
        "2",
        ")"
      ],
      [
        "F",
        ")"
      ],
      [
        "C",
        "N"
      ],
      [
        "c1cc",
        "cc"
      ],
      [
        "C(=O)",
        "N"
      ],
      [
        "C",
        "2"
      ],
      [
        "c2cc",
        "cc"
      ],
      [
        "c",
        "n"
      ],
      [
        ")cc",
        "1"
      ],
      [
        "CC",
        "N"
      ],
      [
        "c",
        "4"
      ],
      [
        "=",
        "C("
      ],
      [
        "3",
        ")"
      ],
      [
        "CC",
        "1"
      ],
      [
        "n",
        "1"
      ],
      [
        "c2cccc",
        "c2"
      ],
      [
        "n",
        "c("
      ],
      [
        "c2cc",
        "c("
      ],
      [
        "C(",
        "C)"
      ],
      [
        "c1cccc",
        "c1"
      ],
      [
        "N",
        "C(=O)"
      ],
      [
        "c3cc",
        "cc"
      ],
      [
        "N",
        ")"
      ],
      [
        "CC",
        "("
      ],
      [
        "CC",
        "(=O)"
      ],
      [
        "CC",
        "O"
      ],
      [
        "S",
        "(=O)"
      ],
      [
        "S(=O)",
        "(=O)"
      ],
      [
        "",
        ")"
      ],
      [
        "CCN",
        "("
      ],
      [
        "C",
        "3"
      ],
      [
        "O",
        "=C("
      ],
      [
        "c3cccc",
        "c3"
      ],
      [
        "O",
        "C)"
      ],
      [
        "c1cc",
        "("
      ],
      [
        "cc",
        "cc"
      ],
      [
        "(",
        "F)"
      ],
      [
        "n",
        "2"
      ],
      [
        "C",
        "="
      ],
      [
        "CC",
        "(C)"
      ],
      [
        "c2",
        "c("
      ],
      [
        "c1",
        "n"
      ],
      [
        "c3cc",
        "c("
      ],
      [
        "cc",
        "1"
      ],
      [
        "cc",
        "("
      ],
      [
        "C",
        "c1ccc("
      ],
      [
        "C(",
        "F)"
      ],
      [
        "CC",
        "2"
      ],
      [
        "F",
        ")cc"
      ],
      [
        "c2",
        ")"
      ],
      [
        "CC(=O)",
        "N"
      ],
      [
        "c2",
        "n"
      ],
      [
        "c2ccccc2",
        ")"
      ],
      [
        "C(F)",
        "(F)"
      ],
      [
        "",
        ")cc"
      ],
      [
        "c(",
        "=O)"
      ],
      [
        "C(",
        "O)"
      ],
      [
        "c1cccc",
        "("
      ],
      [
        ")",
        "N"
      ],
      [
        "CO",
        "c1ccc("
      ],
      [
        "4",
        ")"
      ],
      [
        "c2cc",
        "("
      ],
      [
        "O",
        "C"
      ],
      [
        "=",
        "O"
      ],
      [
        "CC",
        "C("
      ],
      [
        "=",
        "N"
      ],
      [
        "CC",
        "CN"
      ],
      [
        "(",
        "C"
      ],
      [
        "c(",
        "-"
      ],
      [
        "CC",
        "C"
      ],
      [
        "c1",
        ")"
      ],
      [
        "2",
        ")cc1"
      ],
      [
        "O",
        "="
      ],
      [
        "N",
        "2"
      ],
      [
        "C(",
        "C"
      ],
      [
        "C(=O)",
        "O)"
      ],
      [
        "c4",
        "cccc"
      ],
      [
        "CC",
        "2)"
      ],
      [
        "c3",
        "c("
      ],
      [
        "nc(",
        "-"
      ],
      [
        "C",
        "c1"
      ],
      [
        "c2",
        "c1"
      ],
      [
        "C(=O)",
        "O"
      ],
      [
        "c3ccccc3",
        ")"
      ],
      [
        "C(C)",
        "(C)"
      ],
      [
        "c3",
