{
    "<s>": 0,
    "<pad>": 1,
    "</s>": 2,
    "<unk>": 3,
    "<mask>": 4,
    "C": 5,
    "(": 6,
    ")": 7,
    "Br": 8,
    "N": 9,
    "c": 10,
    "1": 11,
    "-": 12,
    "2": 13,
    "=": 14,
    "O": 15,
    "3": 16,
    "S": 17,
    "4": 18,
    "Cl": 19,
    "n": 20,
    "#": 21,
    "o": 22,
    "[nH]": 23,
    "F": 24,
    "5": 25,
    "P": 26,
    "s": 27,
    "[N+]": 28,
    "[O-]": 29,
    "I": 30,
    "[N-]": 31,
    "[n+]": 32,
    "6": 33,
    "[S+]": 34,
    "B": 35,
    "[Si]": 36,
    "[Cl+]": 37,
    "[H]": 38,
    "7": 39,
    "[C-]": 40,
    "[PH]": 41,
    "[P+]": 42,
    "[B-]": 43,
    "[Se]": 44,
    "[NH+]": 45,
    "[o+]": 46,
    "[O]": 47,
    "[s+]": 48,
    "[se]": 49,
    "8": 50,
    "[S-]": 51,
    "[I+]": 52,
    "9": 53,
    "[NH3+]": 54,
    "[NH2+]": 55,
    "[BH3-]": 56,
    "[BH2-]": 57,
    "[C+]": 58,
    "%10": 59,
    "p": 60,
    "[c+]": 61,
    "[F+]": 62,
    "[O+]": 63,
    "[SiH]": 64,
    "[cH-]": 65,
    "[SH]": 66,
    "[se+]": 67,
    "[n-]": 68,
    "[SiH2]": 69,
    "[NH-]": 70,
    "%11": 71,
    "[CH+]": 72,
    "[P-]": 73,
    "[I+2]": 74,
    "[F-]": 75,
    "[Si-]": 76,
    "[IH2]": 77,
    "[OH+]": 78,
    "[SiH-]": 79,
    "[BH-]": 80,
    "[CH2+]": 81,
    "cc": 82,
    "CC": 83,
    "O)": 84,
    "C(": 85,
    "c1": 86,
    "c(": 87,
    "c2": 88,
    "=O)": 89,
    "C)": 90,
    "(C": 91,
    "cccc": 92,
    "c3": 93,
    "ccc": 94,
    ")cc": 95,
    "c1cc": 96,
    "C(=O)": 97,
    "2)": 98,
    "ccc(": 99,
    "1CC": 100,
    "C1": 101,
    "F)": 102,
    "(=O)": 103,
    "CC(": 104,
    "1C": 105,
    "CO": 106,
    "cc(": 107,
    "CCCC": 108,
    "N(": 109,
    "(C)": 110,
    "CN": 111,
    "C2": 112,
    "3)": 113,
    "CCC": 114,
    "c1ccc(": 115,
    "cn": 116,
    "c1cccc": 117,
    "=C(": 118,
    "c2cccc": 119,
    "c4": 120,
    "OCC": 121,
    "nc(": 122,
    "c2cc": 123,
    ")n": 124,
    "C(=O)N": 125,
    "C(C)": 126,
    "2CC": 127,
    "CCN": 128,
    "NC(=O)": 129,
    "n1": 130,
    "OC": 131,
    "N)": 132,
    "c2)": 133,
    "Cl)": 134,
    "1)": 135,
    "c3cccc": 136,
    "c2ccc(": 137,
    ")CC": 138,
    "-c2": 139,
    "c(N": 140,
    ")cc1": 141,
    "1O": 142,
    "c1n": 143,
    "n2": 144,
    "c1)": 145,
    "c2n": 146,
    "C3": 147,
    "OC)": 148,
    "nn": 149,
    "S(=O)": 150,
    "CC1": 151,
    "c(-": 152,
    "O=": 153,
    "=C": 154,
    ")N": 155,
    "(=O)N": 156,
    "c1ccccc1": 157,
    "c2c(": 158,
    "C(C": 159,
    ")C": 160,
    "F)cc": 161,
    "Cc1": 162,
    "NC": 163,
    "2)cc": 164,
    "C(O)": 165,
    "Cl)cc": 166,
    "c1cc(": 167,
    "(F)": 168,
    "=N": 169,
    "c2ccccc2": 170,
    "NC(": 171,
    "c3ccc(": 172,
    "c(=O)": 173,
    "C1CC": 174,
    "CC(=O)": 175,
    "C(F)": 176,
    "1CO": 177,
    "C=": 178,
    "=O": 179,
    "C(=": 180,
    "CCO": 181,
    "c3)": 182,
    "3CC": 183,
    "C)cc": 184,
    "N(C)": 185,
    "O=C(": 186,
    "c3ccccc3": 187,
    "nc2": 188,
    "CC2": 189,
    "CC(C)": 190,
    "cc1": 191,
    "O)cc": 192,
    "N1CC": 193,
    "4)": 194,
    "(-": 195,
    "c1C": 196,
    "c2cc(": 197,
    "3)cc": 198,
    "OC(=O)": 199,
    "-c3": 200,
    "c(C)": 201,
    "c1cccc(": 202,
    "(O)": 203,
    "S(=O)(=O)": 204,
    "c2c1": 205,
    "N2": 206,
    "=CC": 207,
    "c2ccccc2)": 208,
    "NCC": 209,
    "(CC": 210,
    "C(=O)O)": 211,
    "c3c(": 212,
    "ncc": 213,
    "cc2": 214,
    "N(CC": 215,
    "2C": 216,
    "c1c(": 217,
    "2)c1": 218,
    "C(=O)C": 219,
    "(N": 220,
    "OC(": 221,
    "c1O": 222,
    ")c1": 223,
    "c4cccc": 224,
    "(=O)[O-]": 225,
    "c3n": 226,
    "C(F)(F)": 227,
    "c5": 228,
    "C(C)(C)": 229,
    "c1ccccc1)": 230,
    ")cc2": 231,
    "COc1ccc(": 232,
    "cccn": 233,
    "c1CC": 234,
    "c(O)": 235,
    "CC1CC": 236,
    "nc(-": 237,
    "N(C(=O)": 238,
    "nc1": 239,
    "2)CC": 240,
    "C(N": 241,
    "n3": 242,
    "OCO": 243,
    "C#": 244,
    "CS": 245,
    "=O)cc": 246,
    "C(=O)O": 247,
    "c1nc(": 248,
    "2)n": 249,
    "c12": 250,
    "S(=O)(=O)N": 251,
    "c1cc2": 252,
    ")cc2)": 253,
    "CC(=O)N": 254,
    "CCC1": 255,
    "nc(N": 256,
    "Cc1ccc(": 257,
    "c1ccc2": 258,
    "C4": 259,
    "N(C": 260,
    "CCC(": 261,
    "nc3": 262,
    "C2CC": 263,
    "CC2)": 264,
    "CC(O)": 265,
    "1CCN(": 266,
    ")cc1C": 267,
    "c3cc(": 268,
    "CCCCC": 269,
    "c1cn": 270,
    "c2cccc(": 271,
    "1CC(C)": 272,
    "c1ccc(-": 273,
    "cs": 274,
    "1CCCC": 275,
    "c1ccc(N": 276,
    ")cc1CC": 277,
    "C(N)": 278,
    "CCCCCCCC": 279,
    "=C(O)": 280,
    "CCCN": 281,
    "c[nH]": 282,
    "Oc1ccc(": 283,
    "c(C": 284,
    "N=C(": 285,
    "3)n": 286,
    "C(CC": 287,
    "c(OC)": 288,
    "COC(=O)": 289,
    "CC1C": 290,
    "c1ccc2c(": 291,
    "c(Cl)": 292,
    "CNC(=O)": 293,
    "CN(": 294,
    "1O=C(": 295,
    "c1CO": 296,
    "N1": 297,
    "c4ccc(": 298,
    "C(=O)C(": 299,
    "4CC": 300,
    "Br)": 301,
    "c3ccc": 302,
    "C2)": 303,
    "3)CC": 304,
    "c2nc(": 305,
    "OC(C)": 306,
    "C)n": 307,
    "N2CC": 308,
    "c3cc": 309,
    "C(C)C)": 310,
    "[N+](=O)[O-]": 311,
    "n2)": 312,
    "4)cc": 313,
    "ccco": 314,
    "C1C": 315,
    "1C(=O)": 316,
    "c3ccccc3)": 317,
    "n(": 318,
    "ccn": 319,
    "C(F)(F)F)": 320,
    "1COc1ccc(": 321,
    "CN1CC": 322,
    "=C1": 323,
    "c1ccc(-c2": 324,
    "C1=": 325,
    "[O-])": 326,
    "2)cc1": 327,
    "c2ccc(Cl)cc": 328,
    "c4ccccc4": 329,
    "c1-": 330,
    "O)c(": 331,
    "=S": 332,
    "cc(-": 333,
    "C(C)=O)": 334,
    "c1N": 335,
    "2CCCC": 336,
    "CC3": 337,
    "1Cc1ccc(": 338,
    "NC(=O)N": 339,
    "#N)": 340,
    "c(F)": 341,
    "Br)cc": 342,
    "cccs": 343,
    "c2ccc": 344,
    "1N": 345,
    "c2cn": 346,
    "ccccc3": 347,
    "c1cc(C": 348,
    "C(=O)N1CC": 349,
    "=C(C)": 350,
    "N#": 351,
    "c23)": 352,
    "CCC3": 353,
    "ccc4": 354,
    "C)c(": 355,
    "O=C(N": 356,
    "C1O": 357,
    "CCN(": 358,
    "C=C": 359,
    "=C(N": 360,
    "Cc2": 361,
    "P(=O)": 362,
    "Cl)c(": 363,
    "(Cl)": 364,
    "ccccc2": 365,
    "c2ccc(F)cc": 366,
    "cc3": 367,
    "OC)cc": 368,
    "C(F)(F)F)cc": 369,
    "F)c(": 370,
    "ccccc4": 371,
    "N=": 372,
    "-c2ccc(": 373,
    "OCCO": 374,
    "2)cc1CC": 375,
    "C)CC": 376,
    "2)C1": 377,
    "(O": 378,
    "OC1": 379,
    "c2)cc": 380,
    "Nc1ccc(": 381,
    "c1cccc2": 382,
    "NC(=O)C": 383,
    "3CCCC": 384,
    "C(CO)": 385,
    "CC(C)(C)": 386,
    "c3c2": 387,
    "C(=O)NC": 388,
    "CCC4": 389,
    "1CCC(": 390,
    "CC3)": 391,
    "n(C)": 392,
    "C)c1": 393,
    "C(=O)NC(": 394,
    "N3": 395,
    "cccc2": 396,
    "(=O)=O)": 397,
    "OC2": 398,
    "2)cc1C": 399,
    "1CCO": 400,
    "1CC(": 401,
    "N)cc": 402,
    "S(C)": 403,
    "S)": 404,
    "C(=O)OCC": 405,
    "c2cc3": 406,
    "NC(=O)C(": 407,
    "cc(C": 408,
    "cnc3": 409,
    "4)n": 410,
    "C(NC(=O)": 411,
    "O=C(O)": 412,
    "n1C": 413,
    "C(O": 414,
    "2CCN(": 415,
    "c4)": 416,
    "Cn1": 417,
    "Cl)cc1": 418,
    "c1cc(C)": 419,
    "c(=O)n": 420,
    "(C)CC": 421,
    "c1cccc(C": 422,
    "O=C1": 423,
    "c1ccc(Cl)cc": 424,
    "CC(C": 425,
    "c3cccc(": 426,
    "CCCCCC": 427,
    "Nc1n": 428,
    "2CO": 429,
    "N=C": 430,
    "C(=O)NCC": 431,
    "C(=O)C1": 432,
    "n1CC": 433,
    "c1ccc(O": 434,
    "c2[nH]": 435,
    "Cc1cc": 436,
    "NS(=O)(=O)": 437,
    "c1ccc2c(c1)": 438,
    "c3ccc(F)cc": 439,
    "CCC2": 440,
    "C2=O)": 441,
    "OC)c(": 442,
    "ncn": 443,
    "n(C": 444,
    ")cc1)": 445,
    ")c(": 446,
    "c3ccc(Cl)cc": 447,
    "C2(C)": 448,
    "c2ccc3c(": 449,
    "CN2": 450,
    "4)CC": 451,
    "=OC": 452,
    "cnc2": 453,
    "c1ccc(C": 454,
    "CN(C": 455,
    "Nc1": 456,
    "cccc1": 457,
    ")cc(": 458,
    "c2ccccc2)n": 459,
    ")cc3)": 460,
    "CCNC(=O)": 461,
    "c1OCC": 462,
    "c(=O)[nH]": 463,
    "C3CC": 464,
    "n1c(": 465,
    "1)N": 466,
    "CC(=O)O)": 467,
    "F)cc1": 468,
    "2CCOCC": 469,
    "c1ccc(NC(=O)": 470,
    "c2)n": 471,
    "Cl)n": 472,
    "C(=O)O)cc": 473,
    "c2=O)": 474,
    "c2s": 475,
    "c(S": 476,
    "C(C)(C)C)": 477,
    "(C2": 478,
    "S)N": 479,
    "C3)": 480,
    "3)c2": 481,
    "N(C)C)": 482,
    "-c2n": 483,
    "5)": 484,
    "n3)": 485,
    "(OC)": 486,
    "4c(": 487,
    "N(C)CC": 488,
    "1CC1": 489,
    "CN1": 490,
    "c2ccccc1": 491,
    "c2ccc3": 492,
    "c12)": 493,
    "=OCC": 494,
    "C1=O": 495,
    "c3)n": 496,
    "nc(S": 497,
    "C2(": 498,
    "C(O)C(O)": 499,
    "C5": 500,
    "OCC(=O)N": 501,
    "=C2": 502,
    "c1ncn": 503,
    "C(=O)N(": 504,
    "nc(C)": 505,
    "C(=N)": 506,
    "c2ccc(-": 507,
    "C1(C)": 508,
    "C#N)": 509,
    "C(C(=O)N": 510,
    "c1ccc(F)cc": 511,
    "c1nnc(": 512,
    "c(O": 513,
    "n1)": 514,
    "C1(": 515,
    "c1ccc": 516,
    "c3cn": 517,
    "3CCOCC": 518,
    "C(=O)NC(C": 519,
    "c1[nH]": 520,
    "c2ccc(N": 521,
    "CC4": 522,
    "2CCC(": 523,
    "CO)": 524,
    "[N+](=O)[O-])": 525,
    "CC1)": 526,
    "C1CO": 527,
    "CC(C)C)": 528,
    "C(=O)N2CC": 529,
    "CC(NC(=O)": 530,
    "O)c1": 531,
    "c(N)n": 532,
    "c1ccc(C(=O)N": 533,
    "COc1cc(": 534,
    "[nH]c(": 535,
    "2)c(": 536,
    "CCN(C": 537,
    "-c2cc(": 538,
    "1O=": 539,
    "c1=O": 540,
    "c1ccccc1-": 541,
    "C2CCCC": 542,
    "3)C2": 543,
    "c1cc(-": 544,
    "sc(": 545,
    "C1)": 546,
    "C(=O)OC": 547,
    "cnc(": 548,
    "co": 549,
    "c1cc2c(": 550,
    "c3ccccc3)n": 551,
    ")ccc2": 552,
    "n(-": 553,
    "n4": 554,
    "c1nn": 555,
    "OC)c(OC)": 556,
    "cn2": 557,
    ")cc3": 558,
    "S(": 559,
    "n1-": 560,
    "N1CCN(": 561,
    "#C": 562,
    "CN2CC": 563,
    "s2)": 564,
    "CC(N)": 565,
    ")cc1O=C(": 566,
    "2c1": 567,
    "(N)": 568,
    "C(N)=O)": 569,
    "c2ncn": 570,
    "no": 571,
    "S(=O)(=O)c1ccc(": 572,
    "cc(C)": 573,
    "c(C(=O)N": 574,
    "3)cc2": 575,
    "C(O)C1": 576,
    "cccc3": 577,
    "1COc1cc(": 578,
    "c5cccc": 579,
    "-c4": 580,
    "Cc1ccccc1": 581,
    "1COC(=O)": 582,
    "c2cccc3": 583,
    "C(=O)c1": 584,
    "CCN1CC": 585,
    "C(Cc1ccccc1)": 586,
    "OC)c1": 587,
    "n1cc(": 588,
    "Cl)c1": 589,
    "c2)c1": 590,
    "[N+](": 591,
    "n1c(=O)": 592,
    "SCC": 593,
    "C12": 594,
    "c3[nH]": 595,
    "c1s": 596,
    "3)cc1": 597,
    "Cl)c(Cl)": 598,
    "1)c1ccc(": 599,
    "NC1CC": 600,
    "o2)": 601,
    "N)N": 602,
    "C(=O)CC": 603,
    "1)N1CC": 604,
    "cnc(N": 605,
    "#N": 606,
    "3C)": 607,
    "=CC(=O)": 608,
    "c4cc(": 609,
    "CCOC(=O)": 610,
    "s1)": 611,
    "(C(=O)N": 612,
    "c1ccc(CN": 613,
    "COc1cc": 614,
    "N(CC)": 615,
    "C(=O)C2": 616,
    "c1ccccc1C": 617,
    "C2C": 618,
    "C(=O)N2": 619,
    "c4n": 620,
    "c(-c3ccc(": 621,
    "(C)(C)": 622,
    "c2ccc(Cl)cc2)": 623,
    "n1cn": 624,
    "SC": 625,
    "c1cccn": 626,
    "OC(C)=O)": 627,
    "1CC(=O)": 628,
    "P(=O)(O)": 629,
    "1CCOC(=O)": 630,
    "2)cc1CO": 631,
    "1Cc1": 632,
    "-c1ccc(": 633,
    "CCC(=O)N": 634,
    "c2ccccc2)cc": 635,
    ")ccc1": 636,
    "OC3": 637,
    "O)C": 638,
    "CN(C)": 639,
    "cnn": 640,
    "c3ccccc2": 641,
    "1(C)": 642,
    "oc(": 643,
    "c1Cl": 644,
    "CC)": 645,
    "CCCC2": 646,
    "=C(N)": 647,
    "(CO)": 648,
    "ccc2": 649,
    "CCCCC2)": 650,
    "c1c[nH]": 651,
    "C(=O)N(C)": 652,
    "OCCCC": 653,
    "c(C)c1": 654,
    "O)CC": 655,
    "c3ccccc3)CC": 656,
    "c1ccc(C2": 657,
    "N(CC(=O)N": 658,
    "cc(OC)": 659,
    "c3)cc": 660,
    "CCC1CC": 661,
    "CC(F)": 662,
    "3)cc2)": 663,
    "C(=C": 664,
    "c2ccc(-c3": 665,
    "c1O=C(": 666,
    "C(O)=N": 667,
    "S(=O)(=O)c2ccc(": 668,
    "c2)cc1": 669,
    "(=O)=O)cc": 670,
    "CCOCC": 671,
    "N(C)C(=O)": 672,
    "COc1ccccc1": 673,
    "c6": 674,
    "Cc1cc(": 675,
    "oc2": 676,
    "O)cc(": 677,
    "4CCCC": 678,
    "c1cc(Cl)cc": 679,
    "NC1": 680,
    "2)CC1C": 681,
    "C(F)(F)F": 682,
    "C(=O)Nc2ccc(": 683,
    "(CN": 684,
    "2)CC1CC": 685,
    "(F)F)": 686,
    "n2)cc": 687,
    "C(=O)c1ccc(": 688,
    "c2ccncc": 689,
    "C(=N": 690,
    "c2c(=O)": 691,
    "c2ccc3c(c2)": 692,
    "c1cc(N": 693,
    "c1ccc(S(=O)(=O)N": 694,
    "c2cc1": 695,
    "C(=O)OC)": 696,
    "-c2cn": 697,
    "Sc1n": 698,
    "OCC(=O)": 699,
    "3CCN(": 700,
    "(C(F)(F)F)": 701,
    "c3)CC": 702,
    "cc(N": 703,
    "N3CC": 704,
    "s3)": 705,
    "Oc2ccc(": 706,
    "[nH]c2": 707,
    "-c2ccccc2": 708,
    "N)n": 709,
    "c4c(": 710,
    "1CC(=O)N": 711,
    "c(-c2ccc(": 712,
    "C1=N": 713,
    "C=CC": 714,
    "C(C)CC": 715,
    "c4ccccc4)": 716,
    "c1cccc(-": 717,
    "c2ccc(O": 718,
    "c2ccc(F)cc2)": 719,
    "c2ccc(O)cc": 720,
    "C(=O)C=C": 721,
    "c2cccc(Cl)": 722,
    "c1nc(-": 723,
    "NC(=S": 724,
    "c12CC": 725,
    "SCC(=O)N": 726,
    "Cc2ccc(": 727,
    "2)s": 728,
    ")CC3)": 729,
    "c1ccccc1CO": 730,
    "N=C(N)": 731,
    "3C": 732,
    "c1c(C)": 733,
    "n2cn": 734,
    "C12CC": 735,
    "CC1O": 736,
    "O)c(O)": 737,
    "OC1CC": 738,
    "o3)": 739,
    "NC(C)": 740,
    "c3ccc4": 741,
    "c1ccc(-n2": 742,
    "2)o": 743,
    "C#N": 744,
    "C(=O)Nc1ccc(": 745,
    "c1no": 746,
    "1Cc1n": 747,
    "C)cc1": 748,
    "N(C)C)cc": 749,
    "c2o": 750,
    "c2cc(C": 751,
    "1)c1ccccc1": 752,
    "1Cc1cc(": 753,
    "c2n1CC": 754,
    "c2ccc(Cl)cc2": 755,
    "NC(=O)C(C": 756,
    "1Cn1": 757,
    "([O-])": 758,
    "c2ccccc12": 759,
    "=NNC(=O)": 760,
    "[N+](=O)[O-])cc": 761,
    "C(=O)N(C": 762,
    "OC(=O)N": 763,
    "c1ccc(O)cc": 764,
    "nc(N)": 765,
    "3)ccc2": 766,
    "1CC(C)(C)": 767,
    "c3cccn": 768,
    "c2nc3ccccc3": 769,
    "OC(C)(C)": 770,
    "ccc3": 771,
    "c2n1C": 772,
    "CCCCC3)": 773,
    "cc(C(=O)N": 774,
    "c1cccc(-c2": 775,
    "O=S(=O)": 776,
    "c2)CC": 777,
    "c2c(c1)": 778,
    "c3ccc(-": 779,
    "C2=N": 780,
    "c1cc(-c2": 781,
    "1CN(C)": 782,
    "O)cc2": 783,
    "3)CC2)": 784,
    "1CCC": 785,
    "c2ccccc2n": 786,
    "OCC1": 787,
    "C(O)C2": 788,
    "Cl)ccc2": 789,
    "c2ccc(C)cc": 790,
    "[nH]c(=O)": 791,
    "CCS": 792,
    "1CCC2": 793,
    "1)C1CC": 794,
    "n[nH]": 795,
    "(C)C)": 796,
    "CN1C(=O)": 797,
    "3c2": 798,
    "Cc2ccccc2": 799,
    "nc(O)": 800,
    "C1=C(": 801,
    "nc(-c3": 802,
    "c1cccc(Cl)": 803,
    "c1ccc2[nH]": 804,
    "Nc1nc(": 805,
    "N)=O)": 806,
    "C(C)C)cc": 807,
    "=N)": 808,
    "c4cc": 809,
    "ccc5": 810,
    "CC(N": 811,
    "c2cc(Cl)cc": 812,
    "1O=C(O)": 813,
    "cc4": 814,
    "1CN(": 815,
    "c1nc2c(": 816,
    "S(C)(=O)=O)": 817,
    "3)o": 818,
    "NC(=O)CS": 819,
    "NC(=O)CC": 820,
    "c3ccccc23)": 821,
    "1CCCCCC": 822,
    "c2ccc(Br": 823,
    "n2c(": 824,
    "C(C)(C)C)cc": 825,
    "n2)cc1": 826,
    "c2nnc(": 827,
    "1O=C(N": 828,
    "cncn": 829,
    "1OC(": 830,
    "c3ccccc3)cc": 831,
    "sc2": 832,
    "3)c(": 833,
    "CCN1": 834,
    "2CCC": 835,
    "C)cc2": 836,
    "C1CCC2": 837,
    "c1ccco": 838,
    "c2c(C)": 839,
    "c(N)": 840,
    "C2O)": 841,
    "C=C(": 842,
    "12": 843,
    "=OCO": 844,
    "c1ncc(": 845,
    "s1C": 846,
    "c3c2)": 847,
    "O)n": 848,
    "c1COc1ccc(": 849,
    "2O": 850,
    "CCOc1ccc(": 851,
    "C2=O)cc": 852,
    "N1C": 853,
    "ccs": 854,
    "cc(Cl)cc": 855,
    "ccccc1": 856,
    "3)n2": 857,
    "C3=O)": 858,
    "c2ccccc2c1": 859,
    "c2nc(-": 860,
    "nc(-c3ccc(": 861,
    "NC(=O)C2": 862,
    "4CCOCC": 863,
    "C(=O)CS": 864,
    "Cc1n": 865,
    "oc(-": 866,
    "N2C(=O)": 867,
    "c1ccncc": 868,
    "C(CN": 869,
    "c1o": 870,
    "3)nc2": 871,
    "NC(=O)C1CC": 872,
    "-c1ccccc1": 873,
    "C1=O)": 874,
    "o1)": 875,
    "C2(CC": 876,
    "(C)c1": 877,
    "C=CC(=O)": 878,
    "CCn1": 879,
    "Cl)cc2": 880,
    "c1=O)": 881,
    "c2c[nH]": 882,
    "=NN": 883,
    "1COc1ccccc1": 884,
    "c12C": 885,
    "2C(=O)": 886,
    "C2O": 887,
    "c2ccccc2)c1": 888,
    "c1ncc": 889,
    "O2)": 890,
    "C2)cc": 891,
    "O)c2": 892,
    "2)c1C": 893,
    "2)cc1)": 894,
    "N(S(=O)(=O)": 895,
    "1)C(=O)N": 896,
    "c3ccc(F)cc3)": 897,
    "C(=O)NC2": 898,
    "c1cccc(F)": 899,
    "c(C(=O)": 900,
    "c5ccc(": 901,
    "=Cc1ccc(": 902,
    "Cc1cn": 903,
    "o1C": 904,
    "2)cn": 905,
    "4)c3": 906,
    "N=C(O)": 907,
    "-n2": 908,
    "c2cc(-": 909,
    "(C)C3": 910,
    "c2cccc(F)": 911,
    "N(CC)CC": 912,
    "ccccc5": 913,
    "CCNCC": 914,
    "1CCCCC1": 915,
    "c3cccc4": 916,
    "c1cccs": 917,
    "ccc1": 918,
    "N1C(=O)": 919,
    "O)C(O)": 920,
    "CCC1)": 921,
    "4)C": 922,
    "O)cc1)": 923,
    "c1cccc(NC(=O)": 924,
    "1Cc1ccccc1": 925,
    "c(NC(=O)": 926,
    "(CC(=O)N": 927,
    "1O=C1": 928,
    "C(c2ccccc2)": 929,
    "C3CCCC": 930,
    "cn2)": 931,
    "3)c1": 932,
    "c2ccc3ccccc3": 933,
    "F)c(F)": 934,
    "5CC": 935,
    "-c2cc": 936,
    "C=C2": 937,
    "c2cccn": 938,
    "(C)C(": 939,
    "c1ccc(Cl)cc1": 940,
    "C1C(": 941,
    "Cn2": 942,
    "OCCN": 943,
    "CC1(C)": 944,
    "c5ccccc5": 945,
    "C(O)(": 946,
    "C(C(=O)": 947,
    "c2ccccc2)cc1": 948,
    "3)s": 949,
    "NC(=O)c1ccc(": 950,
    "ncc2": 951,
    "c1ccc(-c2ccccc2": 952,
    "=Cc2ccc(": 953,
    "Nc2n": 954,
    "[n+]1": 955,
    "C(CO": 956,
    "N2CCCC": 957,
    "2O=C(": 958,
    "c1ccc(Cl)cc1)": 959,
    "c1cc(C(=O)N": 960,
    "C=N": 961,
    "c2ccco": 962,
    "c1ccc(O)": 963,
    "nc2c1": 964,
    ")n1": 965,
    "c4)n": 966,
    "c1CCO": 967,
    "1)C(=O)": 968,
    "C(=O)c2ccccc2": 969,
    "c1nc2ccccc2": 970,
    "C1CCN(": 971,
    "1CCOCC": 972,
    "CCC(C)": 973,
    "c3ccc(Cl)cc3)": 974,
    "C)cc(": 975,
    ")cc1OCC": 976,
    "c4cn": 977,
    "c3ccc(C)cc": 978,
    "OC(CO)": 979,
    "cn1)": 980,
    "C(=O)NC(C)": 981,
    "c1ccc(Cl)": 982,
    "NC(=O)c2ccc(": 983,
    "C(Cc2ccccc2)": 984,
    "4)cc3)": 985,
    "CC(CC": 986,
    "c1F": 987,
    "c1OC": 988,
    "c2ccccc2F)": 989,
    "sc1": 990,
    "-2": 991,
    "c2ccc(C(=O)N": 992,
    "Cc1c(": 993,
    "c1ccccc1NC(=O)": 994,
    "c2ccc(NC(=O)": 995,
    "([O-]": 996,
    "N)c(": 997,
    "C2C3": 998,
    "3CC(": 999,
    "3)C1": 1000,
    "C(C#N)": 1001,
    "C1=OC": 1002,
    "CCCN(": 1003,
    "c1)CC": 1004,
    "5)cc": 1005,
    "c(=O)c(": 1006,
    "c(=O)o": 1007,
    "[nH]c1": 1008,
    "cn3": 1009,
    ")cc1CO": 1010,
    "C(=S)N": 1011,
    "o1CC": 1012,
    "C(=O)N1": 1013,
    "c1ccc2ccccc2": 1014,
    "cccnc2)": 1015,
    "c1cs": 1016,
    "c2cccs": 1017,
    "c1cccc(N": 1018,
    "C(=O)NC1CC": 1019,
    "c4ccc(F)cc": 1020,
    "c2cccnc2": 1021,
    "-c3ccc(": 1022,
    "NC2": 1023,
    "c2ccc([N+](=O)[O-]": 1024,
    "c1ccc2n": 1025,
    "N1CCOCC": 1026,
    "CCN2": 1027,
    "C(C(=O)O)": 1028,
    "n2cc": 1029,
    "C2=C(": 1030,
    "c(C)n": 1031,
    "c1ccc(OCC": 1032,
    "-c2nn": 1033,
    "c34)": 1034,
    "c(=O)n2": 1035,
    "C(C)(": 1036,
    "OCC2)": 1037,
    "(C)O": 1038,
    "3)c2)": 1039,
    "F)cc2": 1040,
    "CN1CCN(": 1041,
    "O=c1": 1042,
    "CN3": 1043,
    "3c(": 1044,
    "c3ccc(N": 1045,
    "c-": 1046,
    "C(OC(=O)": 1047,
    "ccncc": 1048,
    "n1cc": 1049,
    "cn(C": 1050,
    "OCc1ccccc1": 1051,
    "CCCCCCCCCCCC": 1052,
    "2CC(": 1053,
    "CCC3(C)": 1054,
    "(C3": 1055,
    "CCCO": 1056,
    "3)CC2": 1057,
    "cccc(": 1058,
    "c3ccc4c(": 1059,
    "OCCC": 1060,
    "CC2CC": 1061,
    "C2=O": 1062,
    "c2cccc(-": 1063,
    "c2cc(-c3": 1064,
    "[nH]c3": 1065,
    "c2ccccc2Cl)": 1066,
    "n2cc(": 1067,
    "n2nc(": 1068,
    "=C1CC": 1069,
    "c1cc(O)": 1070,
    "O=C1CC": 1071,
    "C(=O)C(C)": 1072,
    "c3nc(": 1073,
    "1)C2": 1074,
    "c1c(O)": 1075,
    "1CN": 1076,
    "c1ccc2c(c1": 1077,
    "c2-": 1078,
    "c2ccccc2)CC": 1079,
    "S(N)": 1080,
    "2)N": 1081,
    "CO=C(": 1082,
    "c3cccc(Cl)": 1083,
    "C1CCCCC1": 1084,
    "CCCCC2": 1085,
    "=S)": 1086,
    "CCCC3)": 1087,
    "c1c(-": 1088,
    "N(CCCC": 1089,
    "[N+]([O-])": 1090,
    "c1cc(=O)": 1091,
    "(C#N)": 1092,
    "n1O=C(": 1093,
    "c2ccccn2)": 1094,
    "c2ccccc12)": 1095,
    "N(C)C": 1096,
    ")nc2": 1097,
    "c1nc(N": 1098,
    "c1ccc(-c2ccc(": 1099,
    "C2)cc1": 1100,
    "c1ccc([N+](=O)[O-]": 1101,
    "3CCOCC3)": 1102,
    "2)CC1": 1103,
    "[nH]2)": 1104,
    "c3s": 1105,
    "C(F)(F)F)c2)": 1106,
    "Cl)cn": 1107,
    "2)c1CO": 1108,
    "c2nc(N": 1109,
    ")nc3": 1110,
    "c32)": 1111,
    "(c2ccccc2)": 1112,
    "c2cc3c(": 1113,
    "CCCn1": 1114,
    "[nH]n": 1115,
    "Oc1ccccc1": 1116,
    "CC2)cc1": 1117,
    "c1ccccc1Cl": 1118,
    "C(=O)c1ccccc1": 1119,
    "cccnc2": 1120,
    "2)n1": 1121,
    "2)ccc1": 1122,
    "(=O)N1CC": 1123,
    "n1)N": 1124,
    "cc1O": 1125,
    "1CN1CC": 1126,
    "c4ccccc3": 1127,
    "C(c2ccc(": 1128,
    "OCc1ccc(": 1129,
    "nc(N)n": 1130,
    "c2cccc(C(F)(F)F)": 1131,
    "c(C(=O)O)": 1132,
    "CC1CO": 1133,
    "cc(O)": 1134,
    "c1ccccc1)c1ccccc1": 1135,
    "c3ncn": 1136,
    "(CO": 1137,
    "c(OC)c1": 1138,
    "=CCCC": 1139,
    "cc(Cl)": 1140,
    "cnc4": 1141,
    "s1CC": 1142,
    "c1cc(F)cc": 1143,
    "C)o": 1144,
    "oc1": 1145,
    "CN(C(=O)": 1146,
    "Cc2ccccc2)": 1147,
    "1CC2": 1148,
    "c2c1C": 1149,
    "C)cc2)": 1150,
    "nc4": 1151,
    "C1N": 1152,
    "c1ccc2c(c1)OCO": 1153,
    "c1C(=O)N": 1154,
    "(Cc2ccccc2)": 1155,
    "c23)cc": 1156,
    "(NC(=O)": 1157,
    "2)C1CC": 1158,
    "c2ccc(F)cc2": 1159,
    "3)cc1C": 1160,
    "nc(C": 1161,
    "C#N)cc": 1162,
    "c3ccc(O)cc": 1163,
    "COc1cccc(": 1164,
    "c4ccc(Cl)cc": 1165,
    "csc(": 1166,
    "CCCC1": 1167,
    "OCC(": 1168,
    "NCCCC": 1169,
    "NC(=O)O": 1170,
    "COc1ccc(-c2": 1171,
    "c1ccccc1CC": 1172,
    "=C(C(=O)": 1173,
    "c1ccc(Br": 1174,
    "N1CCC(": 1175,
    "c2ncc": 1176,
    "(C(=O)O)": 1177,
    "OCO3)": 1178,
    "OCCCN": 1179,
    "C2CCN(": 1180,
    "oc3": 1181,
    "CCCC3": 1182,
    "O=C(NC": 1183,
    "c1NC(=O)": 1184,
    "=NC": 1185,
    "c2c(O)": 1186,
    "n2-": 1187,
    "c1cccc(C(F)(F)F)": 1188,
    "C2=": 1189,
    ")C2)": 1190,
    "CC(CC(C": 1191,
    "OCC2": 1192,
    "OC)c(OC)c(OC)": 1193,
    "2C)": 1194,
    "NC(=O)CO": 1195,
    "C1C2": 1196,
    "1COc1cccc(": 1197,
    "c3ccncc": 1198,
    "c3ccccc3c2": 1199,
    "c1)N": 1200,
    "CCCC2)": 1201,
    "OCCOCC": 1202,
    "-c2nc(": 1203,
    "[N+](=O)[O-])c1": 1204,
    "c2ncc(": 1205,
    "O)cc1": 1206,
    "2)n1C": 1207,
    "c2c(-": 1208,
    "CC(=O)O": 1209,
    "CN3CC": 1210,
    "2COc1ccc(": 1211,
    "(=O)o": 1212,
    "1COCC": 1213,
    "NC(=O)OC": 1214,
    "n(CC": 1215,
    "P(=O)(": 1216,
    "c3ccc(O": 1217,
    "c1CCCC": 1218,
    "NC(=S)N": 1219,
    "c1Cc1ccc(": 1220,
    "c1CC(C)": 1221,
    "c1)N1CC": 1222,
    "c3ccccc32)": 1223,
    ")cc1Cl": 1224,
    "OCC1)": 1225,
    "c2cc(F)cc": 1226,
    "CCN1C(=O)": 1227,
    "c1cccc2cccc": 1228,
    "Cc1nc(": 1229,
    "c(=O)n(C)": 1230,
    "O)cc2)": 1231,
    "c4c3": 1232,
    "CSc1n": 1233,
    "NC(=": 1234,
    "c(NC": 1235,
    "OC4": 1236,
    "S(=O)(=O)N1CC": 1237,
    "c3n2": 1238,
    "CCCC(=O)": 1239,
    "Nc1ccccc1": 1240,
    "CC(C(=O)N": 1241,
    "N2CCOCC": 1242,
    "C4CC": 1243,
    "c3o": 1244,
    "OCC)": 1245,
    "cc(-c3": 1246,
    "oc2c1": 1247,
    "2)c1CC": 1248,
    "c1nc2cccc": 1249,
    "cn1CC": 1250,
    "1COc1cc(C": 1251,
    "C(OC(C)=O)": 1252,
    "5)n": 1253,
    "c1ccc(F)cc1)": 1254,
    "COC": 1255,
    "2CC(C)": 1256,
    "c1ccccc1N": 1257,
    "c2ccc(S(=O)(=O)N": 1258,
    "3)cn": 1259,
    "3)C": 1260,
    "2CC3": 1261,
    "n2c(=O)": 1262,
    "1Cc1cc": 1263,
    "c1ccccc1F": 1264,
    "OCc1ccccc1)": 1265,
    "cc(F)": 1266,
    "(CCCC": 1267,
    "c1ccc(OC": 1268,
    "C1CC(": 1269,
    "CCC=": 1270,
    "Cc1ccccc1)": 1271,
    "C=C1": 1272,
    "I)": 1273,
    "ncc3": 1274,
    ")C(=O)": 1275,
    "c1ccccc1O=C(": 1276,
    "c3cc(Cl)cc": 1277,
    "n2)cc1CC": 1278,
    "cccc4": 1279,
    "c2ccc(OC)": 1280,
    "2)cc1COc1ccc(": 1281,
    "c4ccccc4)n": 1282,
    "c3ccccc3)cc2": 1283,
    "2CCN(C(=O)": 1284,
    "5)CC": 1285,
    "OC(CO": 1286,
    "C(=O)C3": 1287,
    "N4": 1288,
    "CCCC(=O)N": 1289,
    "2)n1CC": 1290,
    "c2nc(-c3": 1291,
    "c1CN": 1292,
    "S(C)(=O)": 1293,
    "S(=O)(=O)N2CC": 1294,
    "C=CC(=O)N": 1295,
    "cccnc3": 1296,
    "Cc1cccc(": 1297,
    "C3CC3)": 1298,
    "c1ccccc1)N": 1299,
    "2CC2)": 1300,
    "c1ccc(N2CC": 1301,
    "CN1C": 1302,
    "c1cc(NC(=O)": 1303,
    "c2F)": 1304,
    "c3cccc(F)": 1305,
    "c3nn": 1306,
    "4)cc3": 1307,
    "2CCOCC2)": 1308,
    "3CC4": 1309,
    "S(C)(=O)=O)cc": 1310,
    "C3)cc": 1311,
    "c1ccn": 1312,
    "1COc1cc2": 1313,
    "FC(F)(F)": 1314,
    "NC(=O)C(C)": 1315,
    "Br)c1": 1316,
    "O=C(NCC": 1317,
    "c2ccc3n": 1318,
    "c2C)": 1319,
    "c1ccc(-c2n": 1320,
    "C2C(": 1321,
    "C1=OCC": 1322,
    "C(c1ccccc1)": 1323,
    "c3c(C)": 1324,
    "C)C(=O)": 1325,
    "c3c(c2)": 1326,
    "c3ccccn": 1327,
    "c(=O)c2": 1328,
    "oc(=O)": 1329,
    "C(=O)NC3": 1330,
    "N2CCN(": 1331,
    "CCC(=O)": 1332,
    "c3=O)": 1333,
    "c3)cc2": 1334,
    "=OO=C(": 1335,
    "CC1CC(C)": 1336,
    "CC(C)=CC": 1337,
    "c3ccc(Cl)cc3": 1338,
    "NC(=O)CN": 1339,
    "on": 1340,
    "[nH]1)": 1341,
    "cn1C": 1342,
    "cc1-": 1343,
    "c2ccc(C(F)(F)F)cc": 1344,
    "C(C)(O)": 1345,
    "c3ncc": 1346,
    "c2nnn": 1347,
    "=C3": 1348,
    "OC(C": 1349,
    "2)cc1CC(C)": 1350,
    "c2O": 1351,
    "nc(-c2ccc(": 1352,
    "C(=O)NC1": 1353,
    "CN(CC": 1354,
    "c1c(N": 1355,
    "C(n2": 1356,
    "c1cc(C2": 1357,
    "nn3": 1358,
    "c1ccccc1Cl)": 1359,
    "c1cc(OC)": 1360,
    "c1OCO": 1361,
    "C23": 1362,
    "1CS": 1363,
    "C1OC(": 1364,
    "c2ccccc21C": 1365,
    "c(Nc3ccc(": 1366,
    "=O)n": 1367,
    "CCCCN": 1368,
    "O)C(": 1369,
    "n2)cc1C": 1370,
    "4)CC3)": 1371,
    "N=C1": 1372,
    "2c(": 1373,
    "nn2": 1374,
    "nc(NC(=O)": 1375,
    "O2": 1376,
    "c1ccccc1COc1ccc(": 1377,
    "F)cn": 1378,
    "c2ccc(OC)cc": 1379,
    "Cc3ccccc3": 1380,
    "c1cc2c(cc1": 1381,
    "c1ccccc1O": 1382,
    "c3ccccc3)cc2)": 1383,
    "c3)OCO": 1384,
    "S(=O)(": 1385,
    "1C=": 1386,
    "=CC(=O)N": 1387,
    "c(N3CC": 1388,
    "c2c1)": 1389,
    "OCCCO": 1390,
    "C(=S)": 1391,
    "c(CC": 1392,
    "OO": 1393,
    "O)cc3": 1394,
    "1(": 1395,
    "sc2c1": 1396,
    "c2ccccc21CC": 1397,
    "C(Cl)": 1398,
    "n2)c1": 1399,
    "c2cc(N": 1400,
    "C2CO": 1401,
    "[n+](": 1402,
    "nc": 1403,
    "c1nc2cc(": 1404,
    "C(F)F)": 1405,
    "Oc3ccc(": 1406,
    "C2CCC": 1407,
    "=[N+]": 1408,
    "[nH]c(-": 1409,
    "(OCC": 1410,
    "nc1-": 1411,
    "c1ccc(F)cc1": 1412,
    "n12": 1413,
    "COCC": 1414,
    "2C(": 1415,
    "C(=O)C1CC": 1416,
    "oc2cc(": 1417,
    "N1CCN(C": 1418,
    "C3O)": 1419,
    "c2cc(S(=O)(=O)N": 1420,
    "C#C": 1421,
    "Oc1cc": 1422,
    "=OCOc1ccc(": 1423,
    "c2ncccc2": 1424,
    "ncc(": 1425,
    "Cl)cc(": 1426,
    "S(=O)(=O)c1ccccc1": 1427,
    "(c1ccccc1)": 1428,
    "1CC1CC": 1429,
    "C(O)C1O": 1430,
    "OCC1CC": 1431,
    "c1cccc(O": 1432,
    "C(=O)N3CC": 1433,
    "N#Cc1ccc(": 1434,
    "CN2C(=O)": 1435,
    "3)cc1CC": 1436,
    "c1cccc(C(=O)N": 1437,
    "2C1": 1438,
    "P(=O)(O)O)": 1439,
    "c(-c2": 1440,
    "F)c(Cl)": 1441,
    "n1nc(": 1442,
    "2)c2ccccc2": 1443,
    "2)no": 1444,
    "NC(=O)C1": 1445,
    "3F)": 1446,
    "=O)[nH]": 1447,
    "Cl)CC": 1448,
    "c2cc3ccccc3": 1449,
    "c(Cl)c1": 1450,
    "F)n": 1451,
    "c2)C1": 1452,
    "c3cc4": 1453,
    "CCCCCCCCCCCCCCCC": 1454,
    "F)cc1)": 1455,
    "N(C(=O)C": 1456,
    "c1cccc(C)": 1457,
    "c4)cc": 1458,
    "[n+]2": 1459,
    "C(=O)NC(Cc1ccccc1)": 1460,
    "c3ccccc3F)": 1461,
    "c3nc4ccccc4": 1462,
    "c3ccc(Br)cc": 1463,
    "c1n[nH]": 1464,
    "=NO)": 1465,
    "C(=N)N)": 1466,
    "C(=O)Nc3ccc(": 1467,
    "C2C1": 1468,
    "CS(=O)(=O)": 1469,
    "NC(=O)c2cc(": 1470,
    "C(=O)N1C": 1471,
    "Br)cc1": 1472,
    "C)cc3": 1473,
    "nnc(": 1474,
    ")ccc3": 1475,
    "CNC": 1476,
    "c1ccc2nc(": 1477,
    "C1(O)": 1478,
    "C(C)=O)cc": 1479,
    "3CCC(": 1480,
    "S1": 1481,
    "c2ccc(-c3ccccc3": 1482,
    "c3ccccn3)": 1483,
    "=NO": 1484,
    "C(=O)c3ccccc3": 1485,
    "OC(=O)C1": 1486,
    "2)CC1)": 1487,
    "2)cc(OC)": 1488,
    "nc(SCC(=O)N": 1489,
    "(=O)=O": 1490,
    "SC1": 1491,
    "c2cccc(Cl)c2)": 1492,
    "=CC(": 1493,
    "3)[nH]": 1494,
    "cnc1": 1495,
    "C)c(C)": 1496,
    "CC(=N": 1497,
    "c1c(F)": 1498,
    "2CCN(C": 1499,
    "2)cc1O=C(": 1500,
    "c1ccc2o": 1501,
    "C(=N)N": 1502,
    "2)nc1": 1503,
    "C(CCC(=O)O)": 1504,
    "C(Cc1ccc(": 1505,
    "2)C(=O)": 1506,
    "=C(C)C)": 1507,
    "c2ccc(OC": 1508,
    "c2=O)cc": 1509,
    "#Cc1ccc(": 1510,
    "sc3": 1511,
    "c2cc1O": 1512,
    "cn3)": 1513,
    "c1cccc(Cl)c1": 1514,
    "O)O": 1515,
    "nn(-": 1516,
    "1C2": 1517,
    "2)c1COc1ccc(": 1518,
    "c2n1": 1519,
    "c3ccc(F)cc3": 1520,
    "c2ccc(Cl)": 1521,
    "=CC1": 1522,
    "C1CN": 1523,
    "c(CN": 1524,
    "cnn2": 1525,
    "F)cc(F)": 1526,
    "c12CO": 1527,
    "2)c1O=C(": 1528,
    "C(=O)C(=C": 1529,
    "N(Cc2ccccc2)": 1530,
    "C3(C)": 1531,
    "c1ccc(S(=O)(=O)": 1532,
    "CCCCO": 1533,
    "C(=O)N3": 1534,
    "COc2ccc(": 1535,
    "C(=O)CO": 1536,
    "2)C(=O)N": 1537,
    "c2cc(C)": 1538,
    "c5)": 1539,
    "NCCCN": 1540,
    "C(=O)N(CC": 1541,
    "c1c(Cl)": 1542,
    "O3)": 1543,
    "c2c(N": 1544,
    "1(=O)": 1545,
    "c2)cc1C": 1546,
    "c(-c2ccccc2)": 1547,
    "2)CC1CO": 1548,
    "C)cc1CC": 1549,
    "COc1cc(C": 1550,
    "c2nc3c(": 1551,
    "ccc(-": 1552,
    "2CC(=O)N": 1553,
    "C(C)C(": 1554,
    "c1cc(C)cc(": 1555,
    "CNCC": 1556,
    "3CCCCC3": 1557,
    "CCC3)": 1558,
    "O)C1": 1559,
    "nc3cc(": 1560,
    "OCCOC(=O)": 1561,
    "COc1ccc(C2": 1562,
    "c1ccc2cc(": 1563,
    "c1cccc2c1": 1564,
    "c(O)c(": 1565,
    "-c3ccccc3": 1566,
    "c3ccc(C(F)(F)F)cc": 1567,
    "OCc2ccccc2)": 1568,
    "c(-c3ccccc3)": 1569,
    "c2c(Cl)": 1570,
    "3CCN": 1571,
    "N1CCN(C(=O)": 1572,
    "(CC1)": 1573,
    "c1cnc(N": 1574,
    "OC(F)(F)F)cc": 1575,
    "c1CN(C)": 1576,
    "cn1": 1577,
    "=C(C#N)": 1578,
    "Cl)cc1)": 1579,
    "(C#": 1580,
    "CCCCCCN": 1581,
    "c2ccc3c(c2)OCO": 1582,
    "C1OC(CO)": 1583,
    "c3nc(-": 1584,
    "CNS(=O)(=O)": 1585,
    ")n2": 1586,
    "c2ccccc2)cc1CC": 1587,
    "C2CC2)": 1588,
    "c2ccccc2)cc1C": 1589,
    "n2cnc3": 1590,
    "2CN": 1591,
    "C(F)(F)F)cc1": 1592,
    "c(-c4": 1593,
    "OCC(O)": 1594,
    "[nH]c2c1": 1595,
    "OCC1C": 1596,
    "P(=O)(O)O": 1597,
    "=O)cc1C": 1598,
    "1N#": 1599,
    "c2cccc(C)": 1600,
    "2)CC1O=C(": 1601,
    "nc12": 1602,
    "c1cc2cc(": 1603,
    "c1ccc(Cl)c(Cl)": 1604,
    "CC1(": 1605,
    "o2)cc": 1606,
    "C)cc1C": 1607,
    "(=O)O": 1608,
    "N(C(=O)N": 1609,
    "c(C#N)": 1610,
    "Cl)ccc3": 1611,
    "=CCC": 1612,
    "OC)cc(": 1613,
    "2CCO": 1614,
    "c4cccn": 1615,
    "O=C(C=C": 1616,
    "NC(=O)c1ccccc1": 1617,
    "2)O": 1618,
    "1CCC(C)": 1619,
    "CCCCC1": 1620,
    "c1ccccn1": 1621,
    "#CC": 1622,
    "c(=O)n3": 1623,
    "(C(=O)": 1624,
    "c1cc(-c2ccc(": 1625,
    "C)C1": 1626,
    "N(C)S(=O)(=O)": 1627,
    "3)CC2)c1": 1628,
    "c1ncn2": 1629,
    "C(=O)OCC(=O)N": 1630,
    "c1nnn": 1631,
    "1CCCO": 1632,
    "c2c(c1": 1633,
    "c2c(F)": 1634,
    "C(=O)OCO": 1635,
    "1CCOc1ccc(": 1636,
    "Nc1cc": 1637,
    "c3cc4c(": 1638,
    "c2cc1OCC": 1639,
    "=CC2": 1640,
    "F)cc3": 1641,
    "c1ccccc1)C(=O)N": 1642,
    "cccs2)": 1643,
    "Oc1cc(": 1644,
    "ccco2)": 1645,
    "S(=O)(=O)N(C)": 1646,
    "C(CC)": 1647,
    "c21C": 1648,
    "(CC)": 1649,
    "c3C)": 1650,
    "c(C(F)(F)F)": 1651,
    "3CCCC3)": 1652,
    "c2cc(=O)": 1653,
    "c1cccnc1)": 1654,
    "C1c1ccc(": 1655,
    "c1cc(C(F)(F)F)cc": 1656,
    "C2)c1": 1657,
    "c2cc(NC(=O)": 1658,
    "c2nccc(": 1659,
    "c2cc(Cl)ccc2": 1660,
    "NC(=O)C3": 1661,
    "4)C3": 1662,
    "C2)cc1CC": 1663,
    "C(=O)NCCN": 1664,
    "CCCCN)": 1665,
    "c3c[nH]": 1666,
    "CCCCCN": 1667,
    "c2ccs": 1668,
    "c1C#": 1669,
    "SC)": 1670,
    "CSc2n": 1671,
    "c(N2CC": 1672,
    "(-c2ccc(": 1673,
    "c1ccc(S": 1674,
    "c1cc2ccccc2": 1675,
    "c2ccc(O)": 1676,
    "C2(O)": 1677,
    "C1CC(C)": 1678,
    "2CCCCC2": 1679,
    "SC(": 1680,
    "C3(": 1681,
    "c2ccccc2)C1": 1682,
    "c1cn(C": 1683,
    "C(=O)N1CCN(": 1684,
    "c1ccc(Br)cc": 1685,
    "c2cccc(O)": 1686,
    "c(Br)": 1687,
    "CCN3": 1688,
    "c(O)c1": 1689,
    "c2ccc(Cl)c(Cl)": 1690,
    "C2CC(": 1691,
    "1CCN(C": 1692,
    ")cc1F": 1693,
    "C)C(": 1694,
    "c2)CC1CC": 1695,
    "c2)cc1CC": 1696,
    "CC(C)(C)O": 1697,
    "2CC(=O)": 1698,
    "c1nnc(-": 1699,
    "CCC5": 1700,
    "cc(C(=O)": 1701,
    "C1=C(C)": 1702,
    "c3ccccc3Cl)": 1703,
    "C(=O)N1CCCC1": 1704,
    "c1c2c(": 1705,
    "CCN2CC": 1706,
    "c2)c1C": 1707,
    "c3ccc(-c4": 1708,
    "(C)(=O)": 1709,
    "c2ccccc2C1": 1710,
    "CC(N)=O)": 1711,
    "C(N)=O": 1712,
    ")cc1O": 1713,
    "c2cccc(N": 1714,
    "COc1cc2": 1715,
    "N(CCC": 1716,
    "CCC43C)": 1717,
    "2CCCO": 1718,
    "OCC1O": 1719,
    "c1ccc(NC(=O)N": 1720,
    "C1O=C(": 1721,
    "ccccc23)": 1722,
    "c(F)c2)": 1723,
    "c1nn(-": 1724,
    "csc(N": 1725,
    "2N": 1726,
    "C(O)C(C)": 1727,
    "c2ccccc2)CC1CC": 1728,
    "C(C)NC(=O)": 1729,
    "cccnc1": 1730,
    "c1cccc(S(=O)(=O)N": 1731,
    "c2cs": 1732,
    "NC(C": 1733,
    "N#Cc1": 1734,
    ")cc1O=": 1735,
    "c(=O)n(C": 1736,
    "CC(C)O": 1737,
    "NCC1CC": 1738,
    "N#C": 1739,
    "1COc1ccc(-c2": 1740,
    "C)cc3)": 1741,
    "c4ccc5": 1742,
    "2CCOC(=O)": 1743,
    "O)c3": 1744,
    "C(Cc1ccccc1)NC(=O)": 1745,
    "c3ccc(OC)cc": 1746,
    "c1=OC": 1747,
    "F)cc1F": 1748,
    "S)=N": 1749,
    "S2": 1750,
    "c3F)": 1751,
    "c2cccc(C": 1752,
    "c1ccccc1)N1CC": 1753,
    "O=[N+]([O-])": 1754,
    "CC(F)(F)F)": 1755,
    "#N)cc": 1756,
    "CC(O)CO": 1757,
    "(Cc2ccc(": 1758,
    "1Cc1c(": 1759,
    "c4ccccn": 1760,
    "O=c1[nH]": 1761,
    "4)cc2": 1762,
    "c3ccco": 1763,
    "3)C2)": 1764,
    "2)cc(": 1765,
    "Cl)cc1Cl": 1766,
    "c2c1CC": 1767,
    "C(C2)": 1768,
    "C)C2": 1769,
    "CCC3(CC": 1770,
    "c1ccc(C)cc": 1771,
    "NC(=O)C(N)": 1772,
    "c2cc(C(F)(F)F)cc": 1773,
    "c2ccc(OCC": 1774,
    "N(CCO)": 1775,
    "=CC(C)": 1776,
    "=C4": 1777,
    "2(": 1778,
    "N=C2": 1779,
    "CNC(=O)N": 1780,
    "3CC3)": 1781,
    "nc(-c2ccccc2)": 1782,
    "CCCS": 1783,
    "C2)cc1C": 1784,
    "C(C)CO)": 1785,
    "Cl)s": 1786,
    "c1O=": 1787,
    "3CCCCC": 1788,
    "1CC1(C)": 1789,
    "ccc(=O)": 1790,
    "CCC(=O)O)": 1791,
    "=C(C": 1792,
    "N(c2ccc(": 1793,
    "c2c1CO": 1794,
    "C(F)(F)F)n": 1795,
    "C(F)(F)F)cc(C(F)(F)F)": 1796,
    "C3CCC4": 1797,
    "CC(O)CN": 1798,
    "c1O)": 1799,
    "c2cccnc2)": 1800,
    "o2)cc1": 1801,
    "c2ccc(C)": 1802,
    "Cc1cccn": 1803,
    "-c3cc": 1804,
    "OC(C)(C)C)": 1805,
    "[nH]3)": 1806,
    "c(-c2ccccc2)n": 1807,
    "=O)cc1CC": 1808,
    "6)": 1809,
    "c2ccccn": 1810,
    "Cc1ccco": 1811,
    "c4ccccc4)CC": 1812,
    "CCO)": 1813,
    "c1nc(N)": 1814,
    "C1CN(C)": 1815,
    "c3cccc(C(F)(F)F)": 1816,
    "CC(F)(F)": 1817,
    "CCCN(CC": 1818,
    "2)cc1OCC": 1819,
    "ccc(N": 1820,
    "c1ccccc1F)": 1821,
    "C(C)O": 1822,
    "c1Cc1cc(": 1823,
    "C2CCCCC2)": 1824,
    "1CC(O)": 1825,
    "=NCCN": 1826,
    "c21CC": 1827,
    "c1ccc(N2": 1828,
    "4CC(": 1829,
    "O=C1N": 1830,
    "Oc2ccccc2": 1831,
    "C(OC": 1832,
    "(-c2ccccc2)n": 1833,
    "O=S(=O)(": 1834,
    "c1ccc(O)cc1)": 1835,
    "C(O)C3": 1836,
    "c3ccc(C(=O)N": 1837,
    "CC1C(=O)N": 1838,
    "[N+](=O)[O-])cc1": 1839,
    "n1cc(C": 1840,
    "CCN(C)": 1841,
    "c2ccc(O)cc2)": 1842,
    "CC(=C": 1843,
    "S(=O)(=O)c2ccccc2": 1844,
    "1Cc1cccc(": 1845,
    "c1ccc(C(=O)": 1846,
    "c3ccc([N+](=O)[O-]": 1847,
    "C(CO)C(O)C(O)": 1848,
    ")cc12": 1849,
    "c1ccccc1C(=O)N": 1850,
    "2CCCC2": 1851,
    "C1)N": 1852,
    "c3ccccc23)cc": 1853,
    "c1N1CC": 1854,
    "c2ccccc2O": 1855,
    "CCC(NC(=O)": 1856,
    "c3ccco3)": 1857,
    "n2n": 1858,
    "3)CC2)cc": 1859,
    "Br)cc2": 1860,
    "2CCC3": 1861,
    "c1cc(C)c(": 1862,
    "F)CC": 1863,
    "C1COc1ccc(": 1864,
    "c1nn(C)": 1865,
    "O=C(C": 1866,
    "Cl)cc3": 1867,
    "c1ccc(-c2cc": 1868,
    "C(C)N": 1869,
    "O1C": 1870,
    "c2ccc(C": 1871,
    "C(=O)N2C": 1872,
    "4C)": 1873,
    "c(=O)[nH]c1=O": 1874,
    "cnc32)": 1875,
    "[nH]cc": 1876,
    "c1CC(=O)N": 1877,
    "n1CO": 1878,
    "3)nn": 1879,
    "O=C(Nc1ccc(": 1880,
    "c2ccc3[nH]": 1881,
    "CC=": 1882,
    "C(O)C(O)C1": 1883,
    "c3cc(F)cc": 1884,
    "3CCCCC3)": 1885,
    "c2O)": 1886,
    "CNC(=O)C": 1887,
    "C(C)C(=O)N": 1888,
    "c2ccc(-c3ccc(": 1889,
    "CC(O": 1890,
    "c1ccc(C(F)(F)F)cc": 1891,
    "ccnc2": 1892,
    "(OC)c1OCC": 1893,
    "c3ccccc3)c2": 1894,
    "C2S": 1895,
    "NCCN": 1896,
    "c1C(=O)": 1897,
    "C(=O)Nc2ccccc2": 1898,
    "c1ccccc1CC(C)": 1899,
    "c2)o": 1900,
    "c4ccco": 1901,
    "c4cccc(": 1902,
    "2CCC1": 1903,
    "C(N)=N": 1904,
    "c3cccs": 1905,
    "c2ccccc2)cc1)": 1906,
    "S(N)(=O)=O)cc": 1907,
    "c1cc(S(=O)(=O)N": 1908,
    "OCC1OC(": 1909,
    "[N+](C)(C)": 1910,
    "CN2CCCC": 1911,
    "n1nn": 1912,
    "c1Cn1": 1913,
    "=OCC(C)": 1914,
    "N=C(S)N": 1915,
    "c2cc(Br)cc": 1916,
    "(CCN": 1917,
    "=CCO": 1918,
    "S(=O)(=O)C": 1919,
    "O)ccc2": 1920,
    "c2ncnc3": 1921,
    "c1cccc(C2": 1922,
    "CCC4C5": 1923,
    "CN)": 1924,
    "C1CCC(": 1925,
    "C(=O)c2": 1926,
    "c3)c2": 1927,
    "F)cc(": 1928,
    "1COc1ccc(N": 1929,
    "c3ccccc3n": 1930,
    "c2cccc([N+](=O)[O-])": 1931,
    "c1ccnc(": 1932,
    "CCN1CCN(": 1933,
    "CN=C(": 1934,
    "nn(C)": 1935,
    "2)C(": 1936,
    "n2C)": 1937,
    "c1)C1CC": 1938,
    "C2CC3CC": 1939,
    "Br)c(": 1940,
    "c1cc2cccc": 1941,
    "c2ccncc2)": 1942,
    "c3ccc(OC)": 1943,
    "c1Cc1n": 1944,
    "c4)CC": 1945,
    "-c3cn": 1946,
    "CCCCCCCCCC": 1947,
    "n2ccc(": 1948,
    "O)N": 1949,
    "5)C": 1950,
    "C(F)(F)F)cc2": 1951,
    "c1ccc(Nc2n": 1952,
    "COC(=O)C1": 1953,
    "c1cc(N2CC": 1954,
    "c2C1": 1955,
    "C(=O)Nc1ccccc1": 1956,
    "C2(C": 1957,
    "1COc1cccc(C": 1958,
    "O=C(CS": 1959,
    "C(=O)NN=C": 1960,
    "cc1OCC": 1961,
    "c2N": 1962,
    "1C=CC": 1963,
    "c1ccccn1)": 1964,
    "o2)c1": 1965,
    "C1(C)CC": 1966,
    "F)c(N": 1967,
    "(C)c(=O)": 1968,
    "c2c3c(": 1969,
    "CCCN(C(=O)": 1970,
    "c12COc1ccc(": 1971,
    "C(N)=O)cc": 1972,
    "SC2": 1973,
    "CCCCNC(=O)": 1974,
    "c2ccc(Br)cc2)": 1975,
    "n3cn": 1976,
    "c2ccc(Cl)cc2Cl)": 1977,
    "c3cccc(C)": 1978,
    "C(=O)C=": 1979,
    "2CC1": 1980,
    "c4[nH]": 1981,
    "C=CC2": 1982,
    "c2c(C)n": 1983,
    "c1nccc(": 1984,
    "c2ccccc12C": 1985,
    "CCC4(C)C3": 1986,
    "OP(=O)(O)": 1987,
    "(=O)N(": 1988,
    "SS": 1989,
    "OCC3": 1990,
    "C(OC)": 1991,
    ")CC2": 1992,
    "c(=O)c2c1": 1993,
    "scc": 1994,
    "=O)N": 1995,
    "NC(=O)C(CC(C)C)": 1996,
    "c2cc3c(cc2": 1997,
    "nc(C(=O)N": 1998,
    "c1cccnc1": 1999,
    "c1ccc(NS(=O)(=O)": 2000,
    "C(C)C": 2001,
    "O)C(=O)": 2002,
    "c2)CC1C": 2003,
    "C3=N": 2004,
    "c1ccccc1CN": 2005,
    "CN=C(O)": 2006,
    "c(C)c(": 2007,
    "c1ccc2c(c1)OCCO": 2008,
    "CCCN(C)": 2009,
    "nc(SC": 2010,
    "C(F)(F)F)cc2)": 2011,
    "OC(CO)C(O)C(O)": 2012,
    "2)nn": 2013,
    "3CO": 2014,
    "c3c(N": 2015,
    "c(Cl)c2)": 2016,
    "c3ccc4ccccc4": 2017,
    "c1cc2c(cc1O": 2018,
    "c(=O)n(-": 2019,
    "2Cc1ccc(": 2020,
    "c1nc2ccc(": 2021,
    "CCCO)": 2022,
    "c2ccccc2S": 2023,
    "c2cc(C(=O)N": 2024,
    "4)c3)": 2025,
    "NC(=O)c1cc(": 2026,
    "c1c[nH]c2ccccc12)": 2027,
    "N(CCCN": 2028,
    "c1cncc(": 2029,
    "nc(NC": 2030,
    "OC(=O)C(C)": 2031,
    "C(=O)OCC)": 2032,
    "c1ccs": 2033,
    "c1cnc(": 2034,
    "c3cccs3)": 2035,
    "C(F)(F)F)cc1)": 2036,
    "S(=O)(=O)c2ccccc2)": 2037,
    "C(NS(=O)(=O)": 2038,
    "C(CC(=O)O)": 2039,
    "n3)cc": 2040,
    "O=S(=O)(N": 2041,
    "[N+](=O)[O-])n": 2042,
    "C(C)(C)C5": 2043,
    "CCN1C": 2044,
    "C(CC(C)C)": 2045,
    "c1-c1ccc(": 2046,
    "CC(C(=O)O)": 2047,
    "C(=O)N1CCC(": 2048,
    "1CCCC1)": 2049,
    "3)n2)": 2050,
    "c2Cl)": 2051,
    "c(NCC": 2052,
    "n2c1": 2053,
    "CC(OC(=O)": 2054,
    "c2cccc(OC)": 2055,
    "C(F)(F)C(F)(F)": 2056,
    "N(c2ccccc2)": 2057,
    "=[N-]": 2058,
    "CC(C)(O)": 2059,
    "Nc2ccc(": 2060,
    "(Cc1ccccc1)": 2061,
    "N)nc(": 2062,
    "O)c(OC)": 2063,
    "c1ccc2c(c1)CC": 2064,
    "c2ccn": 2065,
    "c1ccco1)": 2066,
    "1CCN(CC": 2067,
    "NC(N)": 2068,
    "4c3": 2069,
    "nc(-c4": 2070,
    "NC(=O)C2CC": 2071,
    "C1=C": 2072,
    "4)ccc3": 2073,
    "1CCN(C(=O)": 2074,
    "C(C)(C)CC": 2075,
    "c3c(F)": 2076,
    "CCCCC3": 2077,
    "1N=C(": 2078,
    "CCCNC(=O)": 2079,
    "O)cc1C": 2080,
    "c1ccccc1)C(=O)": 2081,
    "c(-c3ccccc3": 2082,
    "NC(=N)": 2083,
    "c1)c1ccccc1": 2084,
    "c2ccccc12CC": 2085,
    "C(O)CC": 2086,
    "c2ccccc2)c2ccccc2": 2087,
    "c2ccnc3": 2088,
    "nc(-c3ccccc3)": 2089,
    "1)CC2": 2090,
    "nc(N3CC": 2091,
    "2)c1CC(C)": 2092,
    "1Cc1cc(C)": 2093,
    "2)ccc1O": 2094,
    "2)c1CCO": 2095,
    "C(=O)Cn1": 2096,
    "N(C(=O)CC": 2097,
    "CC(=O)N(": 2098,
    "C(=O)c2ccc(": 2099,
    "N=C(C)": 2100,
    "4CCCCC4": 2101,
    ")nn": 2102,
    "C=C(C)": 2103,
    "C(=O)OC2": 2104,
    "-c1n": 2105,
    "C(=O)N2CCCC": 2106,
    "S(N)(=O)=O)": 2107,
    "c4ccc(-": 2108,
    "c(F)c1": 2109,
    "CCC(N)": 2110,
    "NC(=O)c3ccc(": 2111,
    "c3ccc4c(c3)": 2112,
    "2)cc1Cc1ccc(": 2113,
    "c13)": 2114,
    "CC(O)(C": 2115,
    "c3cc(-": 2116,
    "(C=C": 2117,
    "NC(=S)": 2118,
    "C3C": 2119,
    "c(-c4ccc(": 2120,
    "2)cc2": 2121,
    "CCN(CC": 2122,
    "NCC(=O)N": 2123,
    "C(C)CO": 2124,
    "CCc1ccc(": 2125,
    "O1CC": 2126,
    "[N+](C)": 2127,
    "C2)n": 2128,
    "C2CN": 2129,
    "C)ccc2": 2130,
    "O)ccc3": 2131,
    "cnc(N)": 2132,
    "c1cn(": 2133,
    "c1-c1ccccc1": 2134,
    "C(=NO)": 2135,
    "1CCC1": 2136,
    "c1ccccc1N1CC": 2137,
    "1Cc1nc(": 2138,
    "c4ccccc4)cc": 2139,
    "S(=O)(=O)O)": 2140,
    "c1Cc1": 2141,
    "CC(C3)": 2142,
    "CC(=O)N1CC": 2143,
    "n1c(S": 2144,
    "1COc1ccc(C2": 2145,
    "CCNS(=O)(=O)": 2146,
    "c2c[nH]c3ccccc23)": 2147,
    "n3C)": 2148,
    "1F": 2149,
    "3CC(C": 2150,
    "C3=O)cc": 2151,
    "N(Cc1ccccc1)": 2152,
    "C(C)O)": 2153,
    "cncc": 2154,
    "C1CC(=O)": 2155,
    "(CCC": 2156,
    "c3c(Cl)": 2157,
    "C(C)C)n": 2158,
    "c1cn(-": 2159,
    "c2cccc(F)c2)": 2160,
    "c12O=C(": 2161,
    "c3ncccc3": 2162,
    "c3cccnc3": 2163,
    "c2ccccc21)": 2164,
    "c1cc(Cl)": 2165,
    "CC12": 2166,
    "CC1=C(": 2167,
    "c1ccc(OC)cc": 2168,
    "S(=O)(=O)N2CCCC": 2169,
    "1NC(=O)": 2170,
    "C4)": 2171,
    "2)CC1COc1ccc(": 2172,
    "C1)C2": 2173,
    "4(C)": 2174,
    "=C(C(=O)O)": 2175,
    "ncnc(N": 2176,
    "-c2ccccc2)": 2177,
    "c2cccc(C(F)(F)F)c2)": 2178,
    "n1-c1ccccc1": 2179,
    "C(c3ccccc3)": 2180,
    "4)cn": 2181,
    "cc2c(": 2182,
    "C(=O)NS(=O)(=O)": 2183,
    "c4ccccc4)cc3)": 2184,
    "C(C)=": 2185,
    "n5": 2186,
    "n2nn": 2187,
    "C(=O)c2cc(": 2188,
    "s2)cc": 2189,
    "=O)o": 2190,
    "C1CC1": 2191,
    "n2c(-": 2192,
    "Cl)c2": 2193,
    "C(=O)NC(CC(=O)O)": 2194,
    "c(C)nn": 2195,
    "=CCN": 2196,
    "1Cl": 2197,
    "C(OC2": 2198,
    "CC1N": 2199,
    "C(O)C(": 2200,
    "3CCCC3": 2201,
    "1COC(=O)C1": 2202,
    "C2(CC1)": 2203,
    "c2nc(N)": 2204,
    "c1ncccc1": 2205,
    "1CCCCCCCCCC": 2206,
    "c1)c1ccc(": 2207,
    "C(O)CN": 2208,
    "c(-c2ccccc2": 2209,
    "c2ccccc2)CC1C": 2210,
    "C2CC3": 2211,
    "c3cccnc3)": 2212,
    "N1CCCCC1": 2213,
    "1O=C(Nc1ccc(": 2214,
    "C1C(O)": 2215,
    "c2cccc(Br)": 2216,
    "C(=O)N1CCN(C(=O)": 2217,
    "2)C": 2218,
    "CCOC(=O)C1": 2219,
    "C3CCCCC3)": 2220,
    "NS(=O)(=O)c1ccc(": 2221,
    "CC3)cc": 2222,
    "c2ccc(-n3": 2223,
    "C(=O)NCC(=O)N": 2224,
    "NCC(O)": 2225,
    "O=C1c2ccccc2": 2226,
    "c(=O)n(": 2227,
    "c3cccc(-": 2228,
    "C1CC2": 2229,
    "OCC(C)": 2230,
    "C(=O)C(=O)N": 2231,
    "c1ccc(Cl)cc1C": 2232,
    "C1=C(O)": 2233,
    "n1n": 2234,
    "c2ccc3c(c2)OCO3)": 2235,
    "N(C)CC3)": 2236,
    "C1Cc1ccc(": 2237,
    "4)C2)": 2238,
    "CCC=C(C)": 2239,
    "O)cc(O)": 2240,
    "c2ccco2)": 2241,
    "=CCC1": 2242,
    "c2cccc(O": 2243,
    "(C)C2": 2244,
    "C(C)(C)O": 2245,
    "COc1ccc(NC(=O)": 2246,
    "c1=OCC": 2247,
    "C(=O)NO)": 2248,
    "nn2)": 2249,
    "c1cccc(Cl)c1)": 2250,
    "3)no": 2251,
    "C(=O)NCCCC": 2252,
    "Br)cc(": 2253,
    "c1cc(Br)cc": 2254,
    "Cc2ccco": 2255,
    "c3ccc(Cl)c(Cl)": 2256,
    "CC(C)CC": 2257,
    "2)cc1Cl": 2258,
    "C(F)(F)F)cn": 2259,
    "c(C)c1C": 2260,
    "(Cc3ccccc3)": 2261,
    "O)C2": 2262,
    "C(=O)NC(CC(C)C)": 2263,
    "C6": 2264,
    "c1cc(O": 2265,
    "nn[nH]": 2266,
    "CCC12CC": 2267,
    ")c3": 2268,
    "c3c(c2": 2269,
    "1CNC(=O)": 2270,
    "c3c(-": 2271,
    "1CC1)": 2272,
    "3CCOCC3)cc": 2273,
    "C(=O)NC(CCCN": 2274,
    "c3ccccc3)CC2)": 2275,
    "CN1C(=O)C(": 2276,
    "c4cccc(Cl)": 2277,
    "Nc1ncn": 2278,
    "=O)CC": 2279,
    "C(C)C1": 2280,
    "c2cnn3": 2281,
    "1CN(C": 2282,
    "c2ccc(Cl)cc2)n": 2283,
    "1COc1cc": 2284,
    "S(=O)(N": 2285,
    "C(O)C2O)": 2286,
    "c1cco": 2287,
    "2)c1)": 2288,
    "1OCC": 2289,
    "c2ccccc2)CC1)": 2290,
    "SCC(=O)": 2291,
    "c2)cn": 2292,
    "c2ccc3ccccc3c2)": 2293,
    "NC(=O)c1cn": 2294,
    "c1cccc(O)": 2295,
    "OCCOc1ccc(": 2296,
    "c2)c(": 2297,
    "c1ncc(-": 2298,
    "c4ccccc34)": 2299,
    "4CC4)": 2300,
    "n3c(": 2301,
    "CC1CN(": 2302,
    "C2CCCCC": 2303,
    "c(-c3ccccc3)n": 2304,
    "c23": 2305,
    "C1OC(=O)": 2306,
    "C4)n": 2307,
    ")cc1-": 2308,
    "c3cc(C": 2309,
    "c3cc(OC)c(OC)": 2310,
    "c(=O)c2cc(": 2311,
    "C3=C(": 2312,
    "cn4": 2313,
    "C2CCCCC2": 2314,
    "2CN(C)": 2315,
    "COC1": 2316,
    "C1C2CC": 2317,
    "CCC2)": 2318,
    "nc2-": 2319,
    "CC2)cc": 2320,
    "n2C": 2321,
    "4CCOCC4)": 2322,
    "c2ccc(C(=O)O)cc": 2323,
    "c2ccc3c(c2)OCCO": 2324,
    "CN1CCC(": 2325,
    "(C1)": 2326,
    "O)cc1CC": 2327,
    "F)ccc3": 2328,
    "C(=O)O)cn": 2329,
    "ncc4": 2330,
    "n1O=C(N": 2331,
    "-c2c(": 2332,
    "[Si](C)(C)": 2333,
    "c1ccccc1OCC": 2334,
    "c1c(C(=O)N": 2335,
    "C(=O)CN": 2336,
    "c1sc(": 2337,
    "c1nnc(S": 2338,
    "c3ccc(NC(=O)": 2339,
    "NC(=O)c2ccccc2": 2340,
    "c4ccccc4)CC3)": 2341,
    "CC2(C)": 2342,
    "c(=O)c(C(=O)O)": 2343,
    "NC(=O)C=C": 2344,
    "cccc1Cl": 2345,
    "n1ncc": 2346,
    "3CCC": 2347,
    "Nc2": 2348,
    "=C(N)N)": 2349,
    "C(O)C(C)(C)": 2350,
    "CCCCC4": 2351,
    "C(O)(C": 2352,
    "[n+]([O-])": 2353,
    "c1ccc2c(=O)": 2354,
    ")C3)": 2355,
    "C(=O)NCc1ccc(": 2356,
    "c1cccc(C)c1": 2357,
    "c1Cl)": 2358,
    "4)nc3": 2359,
    "c1ccc(CO": 2360,
    ")C1CC": 2361,
    "c2cccs2)": 2362,
    "c2c(n": 2363,
    "3CC(CC(C": 2364,
    "cc1C": 2365,
    "Cc1cccs": 2366,
    "C(=O)Nc1n": 2367,
    "=Cc1ccccc1": 2368,
    "C(CS": 2369,
    "4CCN(": 2370,
    "O=C(NN=C": 2371,
    "C(F)F)cc": 2372,
    "N(C(C)=O)": 2373,
    "c-2": 2374,
    "cc(-c3ccc(": 2375,
    "3)c2c1": 2376,
    "n3cc": 2377,
    "(OC)c1O": 2378,
    "3CCCO": 2379,
    "c3ccc4c(c3)OCO": 2380,
    "cc1Cl": 2381,
    "OC)cc2": 2382,
    "OC5": 2383,
    "c1)C(=O)": 2384,
    "C(=O)OC(C)(C)": 2385,
    "cnc2c1": 2386,
    "c1O=C(N": 2387,
    "cc12": 2388,
    "CC1(O)": 2389,
    "Sc2n": 2390,
    "1OC)": 2391,
    "c2cccc3c2": 2392,
    "c1ccccn": 2393,
    ")cc(OC)": 2394,
    "c3cccc(O)": 2395,
    "3C(=O)": 2396,
    "c1co": 2397,
    "c2ccccc2-": 2398,
    "Br)cc1)": 2399,
    "C=CC1": 2400,
    "F)ccc2": 2401,
    "CN3CCCC": 2402,
    "c2cccc(NC(=O)": 2403,
    "1C1CC": 2404,
    "CC2CO": 2405,
    "2CCCC2)": 2406,
    "c1nc(C)": 2407,
    ")N1CC": 2408,
    "S(=O)(=O)CC": 2409,
    "nc(-c2": 2410,
    "c1CS": 2411,
    "c2ccccc2O)": 2412,
    "CC3CC": 2413,
    "Nc2ccccc2": 2414,
    "c1ccnc2": 2415,
    "c3c(O)": 2416,
    "C2CCCN2": 2417,
    "c1cccs1)": 2418,
    "c1ccccc1Cc1ccc(": 2419,
    "NC(=O)C(NC(=O)": 2420,
    "O)cc3)": 2421,
    "Cc1c[nH]": 2422,
    "c1OCCCC": 2423,
    "c1ccc(-c2cn": 2424,
    "2)cc1CCOC(=O)": 2425,
    "CC(=O)OCC": 2426,
    "Sc1ccc(": 2427,
    "c1nc(N2CC": 2428,
    "1COc1ccc2c(c1)": 2429,
    "c6cccc": 2430,
    "c2ccc(CN": 2431,
    "C2(C)C(": 2432,
    "c4ccc(O)cc": 2433,
    "3)OCO": 2434,
    "Cn1c(=O)": 2435,
    "O=C(CC": 2436,
    "2)cc1F": 2437,
    "ccn2": 2438,
    "COc1ccc(S(=O)(=O)N": 2439,
    "[nH]c4": 2440,
    "CCC1)N": 2441,
    "c1COc1cc(": 2442,
    "CC(=O)OC": 2443,
    "s3)cc": 2444,
    "n1c(-": 2445,
    "N=C(N)N": 2446,
    "C1CN(": 2447,
    "B(O)": 2448,
    "1)C(": 2449,
    "c1ncc2": 2450,
    "4CC5": 2451,
    "nnc1": 2452,
    "C(=O)NCCCN": 2453,
    "c1ccccc1)CC": 2454,
    "(C(C)C)": 2455,
    "C(=CC": 2456,
    "ccc4c(": 2457,
    "Br)n": 2458,
    "cnc2c1ncn": 2459,
    "OC(C)C)": 2460,
    "CO)cc": 2461,
    "c1ncnc2": 2462,
    "C(C)C2": 2463,
    "C1CCN(C": 2464,
    "c(N3": 2465,
    "Clc1ccc(": 2466,
    "c1nc(O)": 2467,
    "C(C)=N": 2468,
    "c1ccncc1)": 2469,
    "3)CC2)cc1CC": 2470,
    "(C)c3": 2471,
    "c1cc(Cl)cc(Cl)": 2472,
    "c2ccnc(N": 2473,
    "3)cc2)c1": 2474,
    ")(": 2475,
    "C(C)(C": 2476,
    "CN2CCN(": 2477,
    "nc2s": 2478,
    "Nc1nc(-": 2479,
    "Cc2cc(": 2480,
    "NC(=N": 2481,
    "OC)cc2)": 2482,
    "CC12CC": 2483,
    "CN1CCN(C": 2484,
    "2O=C(N": 2485,
    "COc1ccc(C": 2486,
    "nc2cc(": 2487,
    "Cc2n": 2488,
    "5CCOCC": 2489,
    "OCc3ccccc3)": 2490,
    "cc(C)cc": 2491,
    "=C(Cl)": 2492,
    "C2CCN(C(=O)": 2493,
    "c1ccc(-c2cc(": 2494,
    "c(C)c1CC": 2495,
    "C=C3": 2496,
    "O=[N+](": 2497,
